[{"data":1,"prerenderedAt":909},["ShallowReactive",2],{"page-data":3,"docs-/news/articles/2024-07-29-sve_41-blog-intelligent-transportation":54,"content-query-yOx4RBdQcZ":416,"navigation":437},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":5,"title":7,"description":8,"visible":9,"body":10,"_type":49,"_id":50,"_source":51,"_file":52,"_extension":53},"/announcement","",false,"Announcement","uCIFI® Alliance Joins Forces with OMA SpecWorks. Click HERE to learn more.",true,{"type":11,"children":12,"toc":46},"root",[13],{"type":14,"tag":15,"props":16,"children":17},"element","p",{},[18],{"type":14,"tag":19,"props":20,"children":23},"span",{"className":21},[22],"text-2xl",[24,27,44],{"type":25,"value":26},"text","uCIFI® Alliance Joins Forces with OMA SpecWorks. Click ",{"type":14,"tag":28,"props":29,"children":41},"a",{":target":30,"className":31,"href":38,"rel":39},"_blank",[32,33,34,35,36,37],"animate-pulse","font-extrabold","text-teal-500","hover:text-teal-300","dark:text-teal-500","hover:dark:text-teal-300","https://www.einpresswire.com/shareable-preview/bDaRtTUI5OK5YYG1pF1NZw",[40],"nofollow",[42],{"type":25,"value":43},"HERE",{"type":25,"value":45}," to learn more.",{"title":5,"searchDepth":47,"depth":47,"links":48},2,[],"markdown","content:announcement.md","content","announcement.md","md",{"_path":55,"_dir":56,"_draft":6,"_partial":6,"_locale":5,"title":57,"description":58,"layout":56,"urlImage":59,"imageBackground":5,"subtitle":60,"leftLabel":61,"rightLabel":62,"cardID":63,"tags":64,"excerpt":67,"body":82,"_type":49,"_id":414,"_source":51,"_file":415,"_extension":53},"/news/articles/2024-07-29-sve_41-blog-intelligent-transportation","articles","The Emergence of Intelligent Transportation, Riding Smart","Disruption at its finest…the transportation and the automotive industry embraces data intelligence, sensors, IoT, AI, and real-time edge computing to deliver advanced driving experiences. Urban modernization gives rise to the intelligent transportation market, integrating a variety of machines and technologies to enhance the efficiency, safety, and sustainability of transportation systems. Below we will dive into autonomous vehicles, electric vehicles, public transit, and transportation management.","/images/news/intelligent-transportation.png",null,"2024-July-29","OMA",100,[65,66],"news","workshop",{"type":11,"children":68},[69],{"type":14,"tag":15,"props":70,"children":71},{},[72,74,80],{"type":25,"value":73},"Disruption at its finest…the transportation and the automotive industry embraces data intelligence, sensors, IoT, AI, and real-time edge computing to deliver advanced driving experiences. Urban modernization gives rise to the ",{"type":14,"tag":75,"props":76,"children":77},"strong",{},[78],{"type":25,"value":79},"intelligent transportation market",{"type":25,"value":81},", integrating a variety of machines and technologies to enhance the efficiency, safety, and sustainability of transportation systems. Below we will dive into autonomous vehicles, electric vehicles, public transit, and transportation management.",{"type":11,"children":83,"toc":406},[84,93,100,112,124,129,134,179,185,198,210,222,227,240,246,265,277,283,302,321,344,350,355,376,381,394],{"type":14,"tag":15,"props":85,"children":86},{},[87,88,92],{"type":25,"value":73},{"type":14,"tag":75,"props":89,"children":90},{},[91],{"type":25,"value":79},{"type":25,"value":81},{"type":14,"tag":94,"props":95,"children":97},"h3",{"id":96},"autonomous-vehicles-avs",[98],{"type":25,"value":99},"Autonomous Vehicles (AVs)",{"type":14,"tag":15,"props":101,"children":102},{},[103,105,110],{"type":25,"value":104},"Slow going overall, autonomous vehicles (including for transit, trucking, consumers) are moving from a testing phase to a revenue generating market phase, as small-scale rollouts continue. AVs include self-driving cars and trucks equipped with sensors, cameras, and machine learning to ",{"type":14,"tag":75,"props":106,"children":107},{},[108],{"type":25,"value":109},"navigate without human intervention",{"type":25,"value":111},". Companies like Waymo, Zoox, and Nissan are expanding their autonomous vehicle operations across various cities globally.",{"type":14,"tag":15,"props":113,"children":114},{},[115,117,122],{"type":25,"value":116},"AVs also use Internet of Things (IoT) to revolutionize transportation through enhanced connectivity and real-time data processing. IoT enables AVs to communicate with other vehicles (V2V), infrastructure, and various devices, forming a ",{"type":14,"tag":75,"props":118,"children":119},{},[120],{"type":25,"value":121},"comprehensive network",{"type":25,"value":123}," that enhances situational awareness and decision-making capabilities. For instance, Vehicle-to-Everything (V2X) communication allows AVs to receive real-time updates on traffic conditions, road hazards, and weather, facilitating more informed and safer driving decisions. This interconnected ecosystem is expected to reduce the likelihood of accidents and traffic congestion, optimizing traffic flow, and enhancing overall road safety.",{"type":14,"tag":15,"props":125,"children":126},{},[127],{"type":25,"value":128},"Additionally, automotive intelligent devices (Advances driving assistance systems, On-board diagnostics, Wire Harnessing, In-dash Computing) in AVs continuously collect vast amounts of data from various sensors, such as lidar, radar, cameras, and ultrasonic sensors. This data is processed both on the vehicle (edge computing) and in the cloud to support advanced functionalities like predictive maintenance, route optimization, and real-time navigation. By analyzing sensor data, machine learning algorithms can improve the vehicle's ability to recognize objects (machine vision), predict the behavior of other road users, and adapt to changing conditions. This constant data flow and analysis will make AVs smarter and more efficient over time.",{"type":14,"tag":15,"props":130,"children":131},{},[132],{"type":25,"value":133},"Latest news in the AV industry include:",{"type":14,"tag":135,"props":136,"children":137},"ul",{},[138,149,159,169],{"type":14,"tag":139,"props":140,"children":141},"li",{},[142,147],{"type":14,"tag":75,"props":143,"children":144},{},[145],{"type":25,"value":146},"Waymo",{"type":25,"value":148}," has rolled out its autonomous taxi services in cities like San Francisco, Los Angeles, and Phoenix, and recently opened up services to all users in San Francisco.",{"type":14,"tag":139,"props":150,"children":151},{},[152,157],{"type":14,"tag":75,"props":153,"children":154},{},[155],{"type":25,"value":156},"Zoox",{"type":25,"value":158}," is also expanding its robotaxi testing to Austin and Miami, and set to launch in Las Vegas later this year.",{"type":14,"tag":139,"props":160,"children":161},{},[162,167],{"type":14,"tag":75,"props":163,"children":164},{},[165],{"type":25,"value":166},"Nissan",{"type":25,"value":168}," has begun public demonstrations of their autonomous driving technologies and announced plans to fully launch in Japan in 2027.",{"type":14,"tag":139,"props":170,"children":171},{},[172,177],{"type":14,"tag":75,"props":173,"children":174},{},[175],{"type":25,"value":176},"Tesla",{"type":25,"value":178}," recently announced full self-driving updates, which is expected to support driving significantly more miles between interventions, aiming for a year without requiring driver intervention once all known bugs are fixed.",{"type":14,"tag":94,"props":180,"children":182},{"id":181},"electric-vehicles-charging-ev",[183],{"type":25,"value":184},"Electric Vehicles & Charging (EV)",{"type":14,"tag":15,"props":186,"children":187},{},[188,190,196],{"type":25,"value":189},"Electric vehicles (EVs) and charging stations are leveraging IoT, AI, and sensors to create a more efficient, dependable, and user-friendly ecosystem. According to the International Energy Agency, new electric car registrations rose to ",{"type":14,"tag":191,"props":192,"children":193},"u",{},[194],{"type":25,"value":195},"1.4 million,",{"type":25,"value":197}," in 2023 (less than the experts predicted) in the U.S. To give further rise to the market, recent commercial news includes companies like Tim Hortons and Walmart Canada starting to integrate electric trucks into their fleets.",{"type":14,"tag":15,"props":199,"children":200},{},[201,203,208],{"type":25,"value":202},"IoT technology connects EVs to a network of charging stations, enabling real-time updates on station availability, charging status, and power consumption. This connectivity allows for the dynamic ",{"type":14,"tag":75,"props":204,"children":205},{},[206],{"type":25,"value":207},"distribution of power across multiple stations",{"type":25,"value":209},", improving the charging process and reducing wait times. Additionally, IoT enables remote monitoring and maintenance of charging stations, ensuring that any issues are promptly addressed to minimize downtime and improve user experience. Smart grids, integrated with IoT, can also balance energy loads by directing EVs to charge during off-peak hours, thereby stabilizing the power grid and reducing energy costs.",{"type":14,"tag":15,"props":211,"children":212},{},[213,215,220],{"type":25,"value":214},"AI and sensors further enhance the innovation in EVs and charging infrastructure. AI and machine learning algorithms analyze data collected from sensors to predict EV battery health, ",{"type":14,"tag":75,"props":216,"children":217},{},[218],{"type":25,"value":219},"optimize charging cycles",{"type":25,"value":221},", and provide personalized recommendations to drivers based on their usage patterns. This synergy of IoT, AI, and sensors not only improves the performance and longevity of EVs but also enhances the overall sustainability and convenience of electric mobility. Despite the innovation, infrastructure and charging stations will need to play catch up, as funding and initiatives have been slow in equitable deployment and construction.",{"type":14,"tag":15,"props":223,"children":224},{},[225],{"type":25,"value":226},"A few notes about delays in EV charging stations include:",{"type":14,"tag":135,"props":228,"children":229},{},[230,235],{"type":14,"tag":139,"props":231,"children":232},{},[233],{"type":25,"value":234},"In Louisiana, where two years after receiving federal funding, the state has yet to request bids from companies to build the charging infrastructure.",{"type":14,"tag":139,"props":236,"children":237},{},[238],{"type":25,"value":239},"In the Kansas City area, underserved communities are experiencing delays and distribution problems which underscores the uneven distribution and accessibility issues.",{"type":14,"tag":94,"props":241,"children":243},{"id":242},"connected-public-transit-systems",[244],{"type":25,"value":245},"Connected Public Transit Systems",{"type":14,"tag":15,"props":247,"children":248},{},[249,251,256,258,263],{"type":25,"value":250},"Public transportation and transit systems (Buses, trams, and trains) are leveraging IoT, AI, and sensors to drive innovation, enhance efficiency, and improve passenger experiences. IoT enables ",{"type":14,"tag":75,"props":252,"children":253},{},[254],{"type":25,"value":255},"real-time tracking",{"type":25,"value":257}," of buses, trains, and trams, providing accurate arrival and departure times to passengers via mobile apps and digital displays at stations. This connectivity ensures that transit authorities can monitor vehicle locations, optimize routes, and manage ",{"type":14,"tag":75,"props":259,"children":260},{},[261],{"type":25,"value":262},"fleet operations",{"type":25,"value":264}," more effectively, reducing delays and improving service reliability. For instance, predictive maintenance powered by IoT sensors can detect potential issues in vehicles before they cause breakdowns, ensuring that public transit systems remain operational and safe.",{"type":14,"tag":15,"props":266,"children":267},{},[268,270,275],{"type":25,"value":269},"AI and sensors play a crucial role in further advancing public transportation systems. AI algorithms analyze data collected from IoT devices and sensors to predict passenger demand, optimize schedules, and manage congestion. For example, AI can dynamically adjust the frequency of buses or trains based on real-time passenger flow data, ensuring that resources are allocated efficiently during peak and off-peak hours. Sensors embedded in transit infrastructure, such as ticketing machines and turnstiles, can also enhance security by ",{"type":14,"tag":75,"props":271,"children":272},{},[273],{"type":25,"value":274},"monitoring for suspicious activities",{"type":25,"value":276}," and alerting authorities in real-time. Furthermore, AI-driven systems can offer personalized travel recommendations to passengers, such as the fastest routes or the least crowded times to travel, thereby enhancing the overall user experience.",{"type":14,"tag":94,"props":278,"children":280},{"id":279},"traffic-management-systems",[281],{"type":25,"value":282},"Traffic Management Systems",{"type":14,"tag":15,"props":284,"children":285},{},[286,288,293,295,300],{"type":25,"value":287},"Traffic management systems (Intelligent Transport Systems – ITS) are harnessing a variety of technologies geared towards urban mobility and reducing congestion. IoT technology enables real-time data collection from a vast array of sources, including road sensors, traffic cameras, and connected vehicles. This data is then used to ",{"type":14,"tag":75,"props":289,"children":290},{},[291],{"type":25,"value":292},"monitor traffic conditions",{"type":25,"value":294},", detect incidents, and manage traffic flow dynamically. For instance, smart traffic signals equipped with IoT sensors can adjust their timing based on current traffic volumes, prioritizing routes with higher congestion and improving overall traffic flow. By integrating IoT, cities can also implement ",{"type":14,"tag":75,"props":296,"children":297},{},[298],{"type":25,"value":299},"adaptive traffic control systems",{"type":25,"value":301}," that respond to real-time data, minimizing delays and enhancing the efficiency of the road network.",{"type":14,"tag":15,"props":303,"children":304},{},[305,307,312,314,319],{"type":25,"value":306},"AI and sensors further enhance the capabilities of traffic management systems by enabling predictive analytics and automated responses. AI algorithms analyze historical and real-time traffic data to ",{"type":14,"tag":75,"props":308,"children":309},{},[310],{"type":25,"value":311},"forecast traffic patterns",{"type":25,"value":313}," and identify potential bottlenecks before they occur. This predictive capability allows traffic managers to implement proactive measures, such as rerouting traffic or adjusting signal timings in anticipation of increased demand. Additionally, sensors embedded in roads and vehicles provide detailed information on speed, vehicle count, and environmental conditions, which AI systems use to ",{"type":14,"tag":75,"props":315,"children":316},{},[317],{"type":25,"value":318},"optimize traffic management",{"type":25,"value":320}," strategies. For example, AI can coordinate traffic signals to create \"green waves\" that reduce stop-and-go driving, thereby decreasing fuel consumption and emissions. These innovations not only improve traffic efficiency but also contribute to safer and more sustainable urban environments.",{"type":14,"tag":135,"props":322,"children":323},{},[324,334],{"type":14,"tag":139,"props":325,"children":326},{},[327,332],{"type":14,"tag":75,"props":328,"children":329},{},[330],{"type":25,"value":331},"Why is this Important?",{"type":25,"value":333}," Advanced traffic control systems will better manage traffic flow, signal timing, and congestion in urban areas. Intelligent infrastructure such as smart traffic lights, connected road signs, and adaptive lighting systems contribute to future innovation.",{"type":14,"tag":139,"props":335,"children":336},{},[337,342],{"type":14,"tag":75,"props":338,"children":339},{},[340],{"type":25,"value":341},"Connecting Intelligent Transportation Data:",{"type":25,"value":343}," These systems use sensors, cameras, and V2X communication to collect data on traffic conditions and dynamically adjust signal timings to optimize traffic flow, including responding to traffic conditions, weather, and other factors in real-time.",{"type":14,"tag":94,"props":345,"children":347},{"id":346},"final-remarks",[348],{"type":25,"value":349},"Final Remarks",{"type":14,"tag":15,"props":351,"children":352},{},[353],{"type":25,"value":354},"The integration of these connected machines in the intelligent transportation market is transforming how transportation systems operate. By leveraging IoT, AI, and real-time data analytics, these technologies aim to create more efficient, safer, and sustainable transportation solutions for the future.",{"type":14,"tag":15,"props":356,"children":357},{},[358,365,367,374],{"type":14,"tag":28,"props":359,"children":362},{"href":360,"rel":361},"https://omaspecworks.org/",[40],[363],{"type":25,"value":364},"OMA SpecWorks",{"type":25,"value":366}," continues to advance the ",{"type":14,"tag":28,"props":368,"children":371},{"href":369,"rel":370},"https://lwm2m.openmobilealliance.org/",[40],[372],{"type":25,"value":373},"LwM2M",{"type":25,"value":375}," (Lightweight Machine-to-Machine) specification to support connecting the unconnected in industrial, utilities, cities, and transportation sectors. The need for low power, remote device management, data analytics, secure communications, and prototype-to-full-scale deployment, is exactly why LwM2M is poised to support the innovation taking place in automotive and transportation. In addition, the data-driven intelligence needed for intelligent transportation will require seamless integration, and our ongoing LwM2M specification developments will allow companies to quickly bring mature IoT offerings to mass markets.",{"type":14,"tag":15,"props":377,"children":378},{},[379],{"type":25,"value":380},"Recommendations for Further Reading:",{"type":14,"tag":15,"props":382,"children":383},{},[384],{"type":14,"tag":28,"props":385,"children":388},{"href":386,"rel":387},"https://www.compassintelligence.com/blog/the-evolving-landscape-of-electric-vehicles-autonomous-vehicles-and-vehicle-technology",[40],[389],{"type":14,"tag":75,"props":390,"children":391},{},[392],{"type":25,"value":393},"The Evolving Landscape of Electric Vehicles, Autonomous Vehicles, and Vehicle Technology",{"type":14,"tag":15,"props":395,"children":396},{},[397],{"type":14,"tag":28,"props":398,"children":400},{"href":399},"/news/articles/2024-06-03-blog-post-sve_41",[401],{"type":14,"tag":75,"props":402,"children":403},{},[404],{"type":25,"value":405},"Harnessing the Power of Automation and IoT in the Utilities Industry",{"title":5,"searchDepth":47,"depth":47,"links":407},[408,410,411,412,413],{"id":96,"depth":409,"text":99},3,{"id":181,"depth":409,"text":184},{"id":242,"depth":409,"text":245},{"id":279,"depth":409,"text":282},{"id":346,"depth":409,"text":349},"content:5.news:articles:2024-07-29-SVE_41-Blog-Intelligent-Transportation.md","5.news/articles/2024-07-29-SVE_41-Blog-Intelligent-Transportation.md",[417],{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":5,"title":7,"description":8,"visible":9,"body":418,"_type":49,"_id":50,"_source":51,"_file":52,"_extension":53},{"type":11,"children":419,"toc":435},[420],{"type":14,"tag":15,"props":421,"children":422},{},[423],{"type":14,"tag":19,"props":424,"children":426},{"className":425},[22],[427,428,434],{"type":25,"value":26},{"type":14,"tag":28,"props":429,"children":432},{":target":30,"className":430,"href":38,"rel":431},[32,33,34,35,36,37],[40],[433],{"type":25,"value":43},{"type":25,"value":45},{"title":5,"searchDepth":47,"depth":47,"links":436},[],[438,553,604,675,703,780,794,815,887,888,891,894,897,900,903,906],{"title":439,"_path":440,"children":441},"OMASPECWORKS","/omaspecworks",[442,479,493,545,551],{"title":443,"_path":444,"children":445},"About","/omaspecworks/about",[446,448,460,477],{"title":364,"_path":447},"/omaspecworks/about/omaspecworks",{"title":449,"_path":450,"children":451},"Intelectual Property Rights","/omaspecworks/about/ipr",[452,455,458],{"title":453,"_path":454},"Members IPR","/omaspecworks/about/ipr/members",{"title":456,"_path":457},"Non Members IPR","/omaspecworks/about/ipr/non-members",{"title":459,"_path":450},"Intellectual Property Rights",{"title":461,"_path":462,"children":463},"Policies & Terms","/omaspecworks/about/policies-terms",[464,467,470,473,476],{"title":465,"_path":466},"Use Agreement","/omaspecworks/about/policies-terms/use-agreement",{"title":468,"_path":469},"Trade Marks","/omaspecworks/about/policies-terms/trademarks",{"title":471,"_path":472},"Openness Policy","/omaspecworks/about/policies-terms/openness",{"title":474,"_path":475},"OMA Meeting Guest Policy","/omaspecworks/about/policies-terms/guest-policy",{"title":461,"_path":462},{"title":478,"_path":444},"About OMA SpecWorks",{"title":480,"_path":481,"children":482},"Membership","/omaspecworks/membership",[483,486,489,492],{"title":484,"_path":485},"Join OMA","/omaspecworks/membership/join",{"title":487,"_path":488},"Membership Benefits","/omaspecworks/membership/benefits",{"title":490,"_path":491},"Members","/omaspecworks/membership/members",{"title":480,"_path":481},{"title":494,"_path":495,"children":496},"Collaborate","/omaspecworks/collaborate",[497,500,503,543],{"title":498,"_path":499},"Working Groups","/omaspecworks/collaborate/working-groups",{"title":501,"_path":502},"Liaison Agreements","/omaspecworks/collaborate/liaison-agreements",{"title":504,"_path":505,"children":506},"Affiliates","/omaspecworks/collaborate/affiliates",[507,512,517,522,527,532,537,542],{"title":508,"_path":509,"children":510},"Location Interoperatility","/omaspecworks/collaborate/affiliates/location-interoperability",[511],{"title":508,"_path":509},{"title":513,"_path":514,"children":515},"Mobile Games Interoperability","/omaspecworks/collaborate/affiliates/mobile-games-interoperability",[516],{"title":513,"_path":514},{"title":518,"_path":519,"children":520},"Mobile Wireless Internet Forum","/omaspecworks/collaborate/affiliates/mobile-wireless-internet-forum",[521],{"title":518,"_path":519},{"title":523,"_path":524,"children":525},"SyncML","/omaspecworks/collaborate/affiliates/syncml",[526],{"title":523,"_path":524},{"title":528,"_path":529,"children":530},"WAP Forum","/omaspecworks/collaborate/affiliates/wap-forum",[531],{"title":528,"_path":529},{"title":533,"_path":534,"children":535},"Wireless Village","/omaspecworks/collaborate/affiliates/wireless-village",[536],{"title":533,"_path":534},{"title":538,"_path":539,"children":540},"InLocation Alliance","/omaspecworks/collaborate/affiliates/in-location-alliance",[541],{"title":538,"_path":539},{"title":504,"_path":505},{"title":544,"_path":495},"Collaborate with OMASpecWorks",{"title":546,"_path":547,"children":548},"Get Involved","/omaspecworks/get-involved",[549],{"title":550,"_path":547},"Get Involved with OMA",{"title":552,"_path":440},"Welcome to OMASPECWORKS",{"title":554,"_path":555,"children":556},"SPECIFICATIONS","/specifications",[557,571,585,603],{"title":558,"_path":559,"children":560},"Search","/specifications/search",[561,562,565,568],{"title":558,"_path":559},{"title":563,"_path":564},"by Specifications","/specifications/search/specifications",{"title":566,"_path":567},"by Enablers","/specifications/search/enablers",{"title":569,"_path":570},"by Public Documents","/specifications/search/public-docs",{"title":572,"_path":573,"children":574},"OMNA Registries","/specifications/registries",[575,580,583],{"title":576,"_path":577,"children":578},"Enabler Registries","/specifications/registries/enablers",[579],{"title":576,"_path":577},{"title":581,"_path":582},"Supporting Data","/specifications/registries/supporting-data",{"title":584,"_path":573},"OMNA Registries Overview",{"title":586,"_path":587,"children":588},"OMA Inventory API","/specifications/api",[589,592,595,598,601],{"title":590,"_path":591},"Abstract Protocol Binding","/specifications/api/abstract",{"title":593,"_path":594},"RESTful API","/specifications/api/http",{"title":596,"_path":597},"SOAP Web Services APIs","/specifications/api/soap",{"title":599,"_path":600},"LDAP APIs","/specifications/api/webidl",{"title":602,"_path":587},"OMA Enablers API's",{"title":554,"_path":555},{"title":373,"_path":605,"children":606},"/lwm2m",[607,621,632,660,671,673],{"title":608,"_path":609,"children":610},"What is LwM2M","/lwm2m/whatis",[611,614,617,620],{"title":612,"_path":613},"LwM2M Components","/lwm2m/whatis/components",{"title":615,"_path":616},"Key Features","/lwm2m/whatis/key-features",{"title":618,"_path":619},"LwM2M Benefits","/lwm2m/whatis/benefits",{"title":608,"_path":609},{"title":622,"_path":623,"children":624},"Applications & Use Cases","/lwm2m/applications-use-cases",[625,628,631],{"title":626,"_path":627},"Industry Use Cases","/lwm2m/applications-use-cases/use-cases",{"title":629,"_path":630},"Industrial Applications","/lwm2m/applications-use-cases/industrial-applications",{"title":622,"_path":623},{"title":633,"_path":634,"children":635},"LwM2M Resources & Tools","/lwm2m/resources",[636,650,653,656,659],{"title":637,"_path":638,"children":639},"LwM2M Registry","/lwm2m/resources/registry",[640,643,646,649],{"title":641,"_path":642},"Objects","/lwm2m/resources/registry/objects",{"title":644,"_path":645},"Resources","/lwm2m/resources/registry/resources",{"title":647,"_path":648},"Vendor Bulk Reservations","/lwm2m/resources/registry/vendor-bulk-reservations",{"title":637,"_path":638},{"title":651,"_path":652},"LwM2M Specifications","/lwm2m/resources/specifications",{"title":654,"_path":655},"LwM2M Enablers","/lwm2m/resources/lwm2m-enablers",{"title":657,"_path":658},"Tutorials & Guidelines","/lwm2m/resources/tutorials-guidelines",{"title":633,"_path":634},{"title":661,"_path":662,"children":663},"Community & Events","/lwm2m/community",[664,667,670],{"title":665,"_path":666},"LwM2M Implementations","/lwm2m/community/implementations",{"title":668,"_path":669},"LwM2M Product Listing","/lwm2m/community/product-listing",{"title":661,"_path":662},{"title":546,"_path":672},"/lwm2m/get-involved",{"title":674,"_path":605},"About LwM2M",{"title":676,"_path":677,"children":678},"UTILITIES","/utilities",[679,682,696,701],{"title":680,"_path":681},"Introduction","/utilities/introduction",{"title":683,"_path":684,"children":685},"Market Potential","/utilities/market-potential",[686,689,692,695],{"title":687,"_path":688},"Use Cases","/utilities/market-potential/use-cases",{"title":690,"_path":691},"LwM2M Utilities Benefits","/utilities/market-potential/whitepaper-lwm2m-utilities-benefits",{"title":693,"_path":694},"LwM2M Metering Use Case","/utilities/market-potential/whitepaper-lwm2m-metering-use-case",{"title":683,"_path":684},{"title":697,"_path":698,"children":699},"Promoting LwM2M for Utilities","/utilities/promotion",[700],{"title":5,"_path":698},{"title":702,"_path":677},"LwM2M for Utilities",{"title":704,"_path":705,"children":706},"NEWS","/news",[707,779],{"title":708,"_path":709,"children":710},"Articles","/news/articles",[711,714,717,720,723,726,729,732,735,738,741,744,747,750,753,756,759,760,763,766,767,770,773,776],{"title":712,"_path":713},"An Application-Layer Approach to End-to-End Security for the Internet of Things","/news/articles/2019-07-30-e2e-security-for-iot",{"title":715,"_path":716},"White Paper - OMA LwM2M - Ready for 5G","/news/articles/2020-01-23-lwm2m-5g",{"title":718,"_path":719},"LwM2M v1.2 is now available!","/news/articles/2020-12-09-lwm2m-release",{"title":721,"_path":722},"uCIFI Alliance Contributes 29 Objects to OMA","/news/articles/2021-03-02-ucifi",{"title":724,"_path":725},"LwM2M in ENISA’s Secure Supply Chain for IoT V1.0","/news/articles/2021-05-19-enisa-lw2m2-wp",{"title":727,"_path":728},"LwM2M in ENISA’s Secure Supply Chain for IoT","/news/articles/2021-07-8-enisa",{"title":730,"_path":731},"LwM2M Objects for nuSIM Integrated SIM","/news/articles/2022-04-12-nusim_objects",{"title":733,"_path":734},"Advanced LwM2M Firmware Update Object","/news/articles/2022-05-30-advance-firmware-update-lwm2m-object",{"title":736,"_path":737},"LwM2M, Bootstrapping in Cellular Networks","/news/articles/2022-06-14-bootstrapping-cellular-networks",{"title":739,"_path":740},"OMA LwM2M v1.2.1 Release","/news/articles/2022-12-09-release-v1_2_1",{"title":742,"_path":743},"IoT and LwM2M for Utilities","/news/articles/2023-06-09-iot-utilities-outreach-post-workshop",{"title":745,"_path":746},"Unlocking Utility Benefits with LwM2M","/news/articles/2023-10-03-outreach-utility-november",{"title":748,"_path":749},"A Tailored Solution for Utilities","/news/articles/2023-11-15-unlocking-utility-benefits-with-lwm2m-nov-15",{"title":751,"_path":752},"Virtual Test Event","/news/articles/2023-11-20-sve-40-virtual-test-event-nov-23",{"title":754,"_path":755},"Revolutionizing the Utilities Sector - The Transformative Power of LwM2M","/news/articles/2024-02-16-utility-webinar-feb-8",{"title":757,"_path":758},"OMA SpecWorks Announces LwM2M Test Event to Enable M2M and IoT Use Cases","/news/articles/2024-05-28-release-sve_41",{"title":405,"_path":399},{"title":761,"_path":762},"Industrial Automation: Connecting Operations, People, Machines","/news/articles/2024-07-05-sve_41-blog-industrial-automation",{"title":764,"_path":765},"Optimizing IoT Device Management: Top 3 Key Considerations","/news/articles/2024-07-27-blog-optimizing-iot",{"title":57,"_path":55},{"title":768,"_path":769},"MQTT vs LwM2M: The Battle of IoT Protocols for Lightweight Connectivity and Secure Device Management","/news/articles/2024-09-27-sve_42-blog-mqtt-vs-lwm2m",{"title":771,"_path":772},"OMA SpecWorks Announces LwM2M Test Event to be Held in Düsseldorf, Germany","/news/articles/2024-09-28-release-sve_42",{"title":774,"_path":775},"Harnessing Intelligence in IoT Dashboard Analytics","/news/articles/2024-11-8-blog-harnessing-intelligence-in-iot",{"title":777,"_path":778},"uCIFI® Alliance Joins Forces with OMA SpecWorks","/news/articles/2024-12-9-press-release-ucifi-joins-oma",{"title":708,"_path":705},{"title":781,"_path":782,"children":783},"EVENTS","/oma-events",[784,787,790,793],{"title":785,"_path":786},"Test Events","/oma-events/test-events",{"title":788,"_path":789},"Workshops","/oma-events/webinar-workshops",{"title":791,"_path":792},"Member's Meeting","/oma-events/members-meetings",{"title":781,"_path":782},{"title":795,"_path":796,"children":797},"TOOLS","/tools",[798,801,804,807,810,813],{"title":799,"_path":800},"LwM2M API Registry","/tools/lwm2m-api-registry",{"title":802,"_path":803},"LwM2M Editor | Validator","/tools/lwm2m-editor-validator",{"title":805,"_path":806},"LwM2M Developer's Tool Kit","/tools/lwm2m-tool-kit",{"title":808,"_path":809},"LwM2M Guidelines","/tools/lwm2m-guidelines",{"title":811,"_path":812},"LwM2M Validation Error Codes","/tools/validation-errors",{"title":814,"_path":796},"LwM2M TOOLS",{"title":816,"_path":817,"children":818},"Guidelines","/guidelines",[819,824,886],{"title":820,"_path":821,"children":822},"Looks & Feel","/guidelines/looks-feel",[823],{"title":680,"_path":821},{"title":825,"_path":826,"children":827},"Components","/guidelines/components",[828,829,832,835,838,841,844,847,850,853,856,859,862,865,868,871,874,877,880,883],{"title":825,"_path":826},{"title":830,"_path":831},"Action Card","/guidelines/components/sh-action-card",{"title":833,"_path":834},"Alert","/guidelines/components/sh-alert",{"title":836,"_path":837},"Avatar","/guidelines/components/sh-avatar",{"title":839,"_path":840},"Badge","/guidelines/components/sh-badge",{"title":842,"_path":843},"Button","/guidelines/components/sh-button",{"title":845,"_path":846},"Card","/guidelines/components/sh-card",{"title":848,"_path":849},"Carousel","/guidelines/components/sh-carousel",{"title":851,"_path":852},"Column","/guidelines/components/sh-column",{"title":854,"_path":855},"Dynamic Table","/guidelines/components/sh-dynamic-table",{"title":857,"_path":858},"FAQ","/guidelines/components/sh-faq",{"title":860,"_path":861},"Image Container","/guidelines/components/sh-img-container",{"title":863,"_path":864},"ListCards","/guidelines/components/sh-list-cards",{"title":866,"_path":867},"Micro Card","/guidelines/components/sh-micro-card",{"title":869,"_path":870},"Multi Column","/guidelines/components/sh-multi-column",{"title":872,"_path":873},"Segment","/guidelines/components/sh-segment",{"title":875,"_path":876},"Social","/guidelines/components/sh-social",{"title":878,"_path":879},"Text&Image","/guidelines/components/sh-text-img",{"title":881,"_path":882},"TwoColumns","/guidelines/components/sh-two-columns",{"title":884,"_path":885},"Video","/guidelines/components/sh-video",{"title":816,"_path":817},{"title":7,"_path":4},{"title":889,"_path":890},"Contact Us","/contact-us",{"title":892,"_path":893},"Frequently Asked Questions","/faq",{"title":895,"_path":896},"Open Mobile Alliance","/",{"title":898,"_path":899},"Landing Page Floaters","/landing-page-floaters",{"title":901,"_path":902},"Landing Page Menu","/landing-page-menu",{"title":904,"_path":905},"Newsletter","/newsletter",{"title":907,"_path":908},"OMA Test Lab","/test-guide",1733857757788]