[{"data":1,"prerenderedAt":908},["ShallowReactive",2],{"docs-/news/articles/2021-05-19-enisa-lw2m2-wp":3,"navigation":520},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"layout":5,"urlImage":10,"imageBackground":7,"subtitle":11,"rightLabel":12,"cardID":13,"leftLabel":14,"tags":15,"excerpt":17,"body":34,"_type":515,"_id":516,"_source":517,"_file":518,"_extension":519},"/news/articles/2021-05-19-enisa-lw2m2-wp","articles",false,"","LwM2M in ENISA’s Secure Supply Chain for IoT V1.0","Formed in 2002, the Open Mobile Alliance (OMA) combined several industry fora working on mobile application protocols. It is a standard developing organization, which develops interoperable protocols. In late 2017, OMA merged with the IPSO Alliance to form a new organization called OMA SpecWorks. Within OMA SpecWorks the technical work is conducted in several working groups. One of those groups develops the Lightweight Machine-to-Machine (LwM2M) protocol to manage Internet of Things (IoT) devices over their entire lifecycle.","/images/news/suply-chain.jpg","Release of ENISA-LwM2M Whitepaper","OMA SpecWorks",6,"2021-May-19",[16],"security",{"type":18,"children":19},"root",[20],{"type":21,"tag":22,"props":23,"children":24},"element","p",{},[25,32],{"type":21,"tag":26,"props":27,"children":28},"strong",{},[29],{"type":30,"value":31},"text","Formed",{"type":30,"value":33}," in 2002, the Open Mobile Alliance (OMA) combined several industry fora working on mobile application protocols. It is a standard developing organization, which develops interoperable protocols. In late 2017, OMA merged with the IPSO Alliance to form a new organization called OMA SpecWorks. Within OMA SpecWorks the technical work is conducted in several working groups. One of those groups develops the Lightweight Machine-to-Machine (LwM2M) protocol to manage Internet of Things (IoT) devices over their entire lifecycle.",{"type":18,"children":35,"toc":509},[36,44,49,54,61,67,69,74,85,90,95,135,140,145,150,157,164,169,174,179,186,192,197,199,204,209,216,223,228,230,243,248,253,259,264,266,271,276,281,287,292,294,299,305,310,312,317,322,328,332,334,339,344,349,354,360,365,367,372,377,383,388,390,428,434,436,488,492,494,497,499,502,504,507],{"type":21,"tag":22,"props":37,"children":38},{},[39,43],{"type":21,"tag":26,"props":40,"children":41},{},[42],{"type":30,"value":31},{"type":30,"value":33},{"type":21,"tag":22,"props":45,"children":46},{},[47],{"type":30,"value":48},"When the European Union Agency for Cybersecurity (ENISA) published their guidelines for a secure IoT supply chain late 2020, were curious as to the role the LwM2M, standardized IoT device management protocol, has in enabling security in the supply chain. This whitepaper is the result of our investigation.",{"type":21,"tag":22,"props":50,"children":51},{},[52],{"type":30,"value":53},"Our findings are that the use of LwM2M provides security benefits through all supply chain stages. It is worthwhile to note that distinctions need to be made between the specification defining the LwM2M protocol, the implementation of the LwM2M protocol in IoT devices and in a device management platform, and the use of the implementation in a specific deployment environment.",{"type":21,"tag":55,"props":56,"children":58},"h3",{"id":57},"lwm2m-in-a-nutshell",[59],{"type":30,"value":60},"LwM2M in a Nutshell",{"type":21,"tag":62,"props":63,"children":64},"b",{},[65],{"type":30,"value":66},"OMA SpecWorks’ LwM2M",{"type":30,"value":68}," specification evolved from its OMA DM standardization used in smart phones. Originally proposed in 2012, LwM2M v1.0 was finally published in early 2017 after comprehensive research with developers across multiple industries and application areas. LwM2M defines a messaging protocol between the LwM2M server infrastructure and LwM2M clients in IoT devices. LwM2M also defines a data model, which is used to offer semantic interoperability of the data exchanged between IoT devices and their management infrastructure. Hence, LwM2M is also used for exchanging application data. The latest version of LwM2M v1.0 is v1.0.2 and it was published in February 2018.\n",{"type":21,"tag":22,"props":70,"children":71},{},[72],{"type":30,"value":73},"LwM2M v1.0 uses the Constrained Application Protocol (CoAP) over UDP and SMS to provide the transport for the LwM2M messages, with operations to create, update, delete, and retrieve resources. In addition to the messaging, a core set of objects were defined, which can be encoded in different data formats. Provisioning of security credentials and access control lists is offered by a dedicated LwM2M bootstrap server, a form of a key distribution server.",{"type":21,"tag":22,"props":75,"children":76},{},[77,79],{"type":30,"value":78},"Figure LwM2M Protocol Architecture shows the overall architecture of the LwM2M protocol.\n",{"type":21,"tag":80,"props":81,"children":84},"img",{"alt":82,"src":83},"image","https://user-images.githubusercontent.com/3258579/135369430-00e46191-0100-4c8f-a0fe-26433ebbcb4a.png",[],{"type":21,"tag":22,"props":86,"children":87},{},[88],{"type":30,"value":89},"For communication between the LwM2M enities, four RESTful interfaces are defined in LwM2M v1.0: three between the LwM2M Client and the LwM2M Server (Client Registration, Device Management & Service Enablement, and Information Reporting) and one interface for use between the LwM2M Client and the LwM2M Bootstrap Server for credential provisioning (called bootstrapping).",{"type":21,"tag":22,"props":91,"children":92},{},[93],{"type":30,"value":94},"LwM2M provides the following capabilities:",{"type":21,"tag":96,"props":97,"children":98},"ul",{},[99,105,110,115,120,125,130],{"type":21,"tag":100,"props":101,"children":102},"li",{},[103],{"type":30,"value":104},"Key management and provisioning of access control lists,",{"type":21,"tag":100,"props":106,"children":107},{},[108],{"type":30,"value":109},"Reading sensor data,",{"type":21,"tag":100,"props":111,"children":112},{},[113],{"type":30,"value":114},"Trigger actuators,",{"type":21,"tag":100,"props":116,"children":117},{},[118],{"type":30,"value":119},"Device configuration,",{"type":21,"tag":100,"props":121,"children":122},{},[123],{"type":30,"value":124},"Software and firmware update,",{"type":21,"tag":100,"props":126,"children":127},{},[128],{"type":30,"value":129},"Report reporting, and",{"type":21,"tag":100,"props":131,"children":132},{},[133],{"type":30,"value":134},"Fault Diagnostics",{"type":21,"tag":22,"props":136,"children":137},{},[138],{"type":30,"value":139},"LwM2M is a mature technology – not only from a standardization point of view but also from an interoperability testing and deployment angle. Below is a short summary of how the specification evolved over time. Each version advanced with new features requested from users of the technology and with feedback from developers.",{"type":21,"tag":22,"props":141,"children":142},{},[143],{"type":30,"value":144},"LwM2M v1.1 was published in July 2018 and split the specification into two: a core specification defining the LwM2M messaging and a transport specification. This was done to put a stronger emphasis on the independence of the LwM2M messaging from the underlying transports. New transports were added to support LwM2M to manage low power, wide area network devices, such as 3GPP NB-IoT and LTE-M as well as LoRaWAN. CoAP over TLS/TCP was added as well.",{"type":21,"tag":22,"props":146,"children":147},{},[148],{"type":30,"value":149},"Figure LwM2M v1.0.x Protocol Stack and Figure LwM2M v1.1.x Protocol Stack show the protocol stacks of LwM2M v1.0.x and LwM2M v1.1.x, respectively.",{"type":21,"tag":22,"props":151,"children":152},{},[153],{"type":21,"tag":80,"props":154,"children":156},{"alt":82,"src":155},"https://user-images.githubusercontent.com/3258579/135369847-817152ee-40d9-4093-9de9-b38eed2a4d27.png",[],{"type":21,"tag":22,"props":158,"children":159},{},[160],{"type":21,"tag":80,"props":161,"children":163},{"alt":82,"src":162},"https://user-images.githubusercontent.com/3258579/135369965-7a543b13-9f5c-4860-b35b-d968a6b8774d.png",[],{"type":21,"tag":22,"props":165,"children":166},{},[167],{"type":30,"value":168},"The latest version of LwM2M 1.1 is v1.1.1, which was published in June 2019.",{"type":21,"tag":22,"props":170,"children":171},{},[172],{"type":30,"value":173},"Over the years, the OMA SpecWorks has worked with the developer community and received suggestions for optimizations. Published in November 2020, version 1.2 is backwards compatible to LwM2M version v1.0 and v1.1 with respect to mandatory features. Based on feedback received from the LwM2M development community, LwM2M v1.2 includes various new features, such as new transports (MQTT and HTTP), support for LwM2M gateways, and performance optimizations.",{"type":21,"tag":22,"props":175,"children":176},{},[177],{"type":30,"value":178},"Figure LwM2M v1.2.x Protocol Stack show the protocol stack of LwM2M v1.2. Note the number of transports supported by the LwM2M protocol, which makes it suitable for a range of deployment environments.",{"type":21,"tag":22,"props":180,"children":181},{},[182],{"type":21,"tag":80,"props":183,"children":185},{"alt":82,"src":184},"https://user-images.githubusercontent.com/3258579/135370105-896c44a7-1ac9-490d-badc-9562e76af984.png",[],{"type":21,"tag":55,"props":187,"children":189},{"id":188},"lwm2m-and-its-part-in-the-enisa-secure-supply-chain",[190],{"type":30,"value":191},"LwM2M and its part in the (ENISA) Secure Supply Chain",{"type":21,"tag":62,"props":193,"children":194},{},[195],{"type":30,"value":196},"The European Union Agency for Cybersecurity (ENISA)",{"type":30,"value":198}," published their Guidelines for Securing the Internet of Things (IoT) – Secure Supply Chain for IoT, in November 2020. We used this document to analyze how its LwM2M met these guidelines – not only to improve the security of the IoT supply chain in general, but to improve security in the development of LwM2M.\n",{"type":21,"tag":22,"props":200,"children":201},{},[202],{"type":30,"value":203},"The ENISA document addresses the entire supply chain across the IoT ecosystem. The LwM2M protocol is a part of that ecosystem. In the analysis, we address the stages of the supply chain reference model as well as applied those stages to the development cycle of a standardized protocol. Some areas of the reference model were a better fit than others, but the intent was to leverage ENISA’s work to the fullest extent possible – not only to give the LwM2M development community and users a view of LwM2M security, but also to identify areas for potential improvement in LwM2M’s security and usefulness.",{"type":21,"tag":22,"props":205,"children":206},{},[207],{"type":30,"value":208},"The stages in the secure supply chain are shown in Figure IoT Supply Chain Stages, a diagram taken from the ENISA recommendation.",{"type":21,"tag":22,"props":210,"children":211},{},[212],{"type":21,"tag":80,"props":213,"children":215},{"alt":82,"src":214},"https://user-images.githubusercontent.com/3258579/135370495-cb38d5fc-1233-498f-81e3-c61627395684.png",[],{"type":21,"tag":217,"props":218,"children":220},"h4",{"id":219},"stage-1-conceptproduct-design",[221],{"type":30,"value":222},"Stage 1 – Concept/Product Design",{"type":21,"tag":62,"props":224,"children":225},{},[226],{"type":30,"value":227},"While the LwM2M protocol",{"type":30,"value":229}," can be considered a “product”, in ENISA’s stages shown in Figure IoT Supply Chain Stages, it is the rule set describing the format and exchange of data between the LwM2M client and servers. Developers then use the protocol to create software for their products, which is part of the IoT supply chain ecosystem described by ENISA.\n",{"type":21,"tag":22,"props":231,"children":232},{},[233,235,241],{"type":30,"value":234},"From the beginning of LwM2M v1.0 development, we used the classical Internet threat model ",{"type":21,"tag":236,"props":237,"children":238},"span",{},[239],{"type":30,"value":240},"RFC3552",{"type":30,"value":242}," as the basis with some modification for smart card usage. We also inherit security models used by our referenced specifications and protocols. The IoT threat landscape has evolved since 2012, so now that v1.2 is published, a review of our security threat model may identify new or changed threats.",{"type":21,"tag":22,"props":244,"children":245},{},[246],{"type":30,"value":247},"Protection of personal data, also called Personally Identifiable Information (PII) in some regions, deserves appropriate protection, which can be accomplished using the communication security and access control mechanisms offered by LwM2M. One important consideration for privacy is the storage of IoT device data in the LwM2M servers since unauthorized access and leakage of such data must be avoided. The use of PII assumes a linkage to humans using IoT devices. The LwM2M protocol itself does not link users to IoT devices, this may happen in deployments using adjacent technologies. It is therefore the responsibility of companies managing IoT devices to take adequate security measures to respect privacy of their users.",{"type":21,"tag":22,"props":249,"children":250},{},[251],{"type":30,"value":252},"Security threats depend on the implementation and the deployment of the software. We respond when the LwM2M development community raises security issues that need to be addressed by the protocol.",{"type":21,"tag":217,"props":254,"children":256},{"id":255},"stage-2-development",[257],{"type":30,"value":258},"Stage 2 – Development",{"type":21,"tag":62,"props":260,"children":261},{},[262],{"type":30,"value":263},"This stage in ENISA’s",{"type":30,"value":265}," model include all the steps necessary to produce a physical device ready to ship to customers. This includes software development. We liken this to the process to produce a LwM2M protocol version – drafting text, reviews, revisions. OMA SpecWorks organizes TestFests to ensure that interoperability between different vendor implementations is accomplished and we receive feedback from these TestFests.\n",{"type":21,"tag":22,"props":267,"children":268},{},[269],{"type":30,"value":270},"In each LwM2M version, we include support for the state-of-the-art security algorithms and protocols. There is, however, the need to support older algorithms (such as AES-CBC) for backwards compatibility reasons. We follow best current practices, such as not supporting passwords and recommending high-entropy secrets.",{"type":21,"tag":22,"props":272,"children":273},{},[274],{"type":30,"value":275},"As a standards developing organization, we do not mandate a specific implementation practice. We specify the protocol. Developers implementing the LwM2M protocol may include imported libraries as part of their product. Since the LwM2M specification uses many specifications developed by other organizations, such as the 3GPP, IETF, Global Platform, there is a bigger chance that software for individual building blocks exists and can therefore be re-used.",{"type":21,"tag":22,"props":277,"children":278},{},[279],{"type":30,"value":280},"The LwM2M specification defines detailed error handling procedures. We have continually enhanced the LwM2M security procedures. Channel security via DTLS was provided since LwM2M v1.0. Support for OSCORE was added in LwM2M v1.1 to provide the capability for CoAP-level security protection. TLS 1.3 and DTLS 1.3 support was added in LwM2M v1.2.",{"type":21,"tag":217,"props":282,"children":284},{"id":283},"stage-3-production",[285],{"type":30,"value":286},"Stage 3 – Production",{"type":21,"tag":62,"props":288,"children":289},{},[290],{"type":30,"value":291},"This stage in ENISA’s model",{"type":30,"value":293}," focuses on production, distribution, and logistics – all the activities needed to deliver product and tracking units in IoT devices.\n",{"type":21,"tag":22,"props":295,"children":296},{},[297],{"type":30,"value":298},"Published versions of LwM2M are publicly available for download at OMA SpecWorks’ website and through our Github site.",{"type":21,"tag":217,"props":300,"children":302},{"id":301},"stage-4-utilization",[303],{"type":30,"value":304},"Stage 4 – Utilization",{"type":21,"tag":62,"props":306,"children":307},{},[308],{"type":30,"value":309},"This is the use of a product",{"type":30,"value":311}," implementing the LwM2M specification for management of IoT devices during their entire lifecycle. Any issues found with the LwM2M protocol can be fed back to our standardization community to add new features or to clarify the specification text.\n",{"type":21,"tag":22,"props":313,"children":314},{},[315],{"type":30,"value":316},"LwM2M provides capabilities to support device management for IoT devices:",{"type":21,"tag":22,"props":318,"children":319},{},[320],{"type":30,"value":321},"It supports secure bootstrapping to provide client credentials used to securely communicate with the LwM2M servers\nIt supports secure device registration with the LwM2M servers\nIt supports secure communications with the LwM2M servers\nThe one area we identified that seems pertinent to this stage is that our specifications do not describe the transfer of ownership and the implications for the software and credentials on the device. We may address this in a future version.",{"type":21,"tag":217,"props":323,"children":325},{"id":324},"stage-5-support",[326],{"type":30,"value":327},"Stage 5 – Support",{"type":21,"tag":62,"props":329,"children":330},{},[331],{"type":30,"value":263},{"type":30,"value":333}," supply chain model focuses on repairing/replacing damaged units and maintaining a device’s security (e.g., maintaining updates, remote support). As LwM2M provides device management capabilities, it is designed to support this stage by providing the abilities to configure the device, update the firmware, and complete remote diagnostics.\n",{"type":21,"tag":22,"props":335,"children":336},{},[337],{"type":30,"value":338},"For the protocol development lifecycle, we accept requests for new features, performance improvements, and bug fixes from our LwM2M development community. We produce bug fix versions (two for v1.0, one for v1.1), although we do not have a self-imposed timeline for these corrected versions.",{"type":21,"tag":22,"props":340,"children":341},{},[342],{"type":30,"value":343},"IoT devices should be upgraded to support newer versions of the LwM2M protocol using the built-in software update mechanism provided by LwM2M. This could include new features and/or updating the level of security.",{"type":21,"tag":22,"props":345,"children":346},{},[347],{"type":30,"value":348},"Notifications of updated specifications happens via our existing communication channels. Involved member organizations, who participate in the specification development, have awareness of upcoming releases and feature roadmaps. When a new version is published, we advertise it to external organizations and developers via OMA SpecWorks’ website as well as via our Github site.",{"type":21,"tag":22,"props":350,"children":351},{},[352],{"type":30,"value":353},"In addition to feedback from the LwM2M development community, we use our liaison interaction with other organizations or members participating in other fora to assist in identifying outdated references, protocols, and libraries in specifications in which LwM2M is dependent as well to identify other security issues.",{"type":21,"tag":217,"props":355,"children":357},{"id":356},"stage-6-retirement",[358],{"type":30,"value":359},"Stage 6 – Retirement",{"type":21,"tag":62,"props":361,"children":362},{},[363],{"type":30,"value":364},"To retire an IoT device",{"type":30,"value":366},", LwM2M offers the capabilities to remove credentials and to reset the device to its factory-state.\n",{"type":21,"tag":22,"props":368,"children":369},{},[370],{"type":30,"value":371},"From a standardization perspective we could either obsolete specifications or stop development of earlier protocol versions. While there are several LwM2M specification versions available already, the protocol is not old enough to retire initial version(s). We do recommend the use of the latest version to developers.",{"type":21,"tag":22,"props":373,"children":374},{},[375],{"type":30,"value":376},"The LwM2M protocol versions have been designed to be backwards compatible so that the server-side infrastructure is able to support different generations of IoT devices.",{"type":21,"tag":217,"props":378,"children":380},{"id":379},"conclusion",[381],{"type":30,"value":382},"Conclusion",{"type":21,"tag":62,"props":384,"children":385},{},[386],{"type":30,"value":387},"Our analysis concluded",{"type":30,"value":389}," that our open standardization process helps with improving security in the following ways:\n",{"type":21,"tag":96,"props":391,"children":392},{},[393,398,403,408,413,418,423],{"type":21,"tag":100,"props":394,"children":395},{},[396],{"type":30,"value":397},"Development of the LwM2M protocol is a right granted to OMA SpecWorks members but we offer a way to interact with the wider development community via Github.",{"type":21,"tag":100,"props":399,"children":400},{},[401],{"type":30,"value":402},"For the work on specification we are also using Github, which enables auditing, and traceability of modifications to our specifications in development.",{"type":21,"tag":100,"props":404,"children":405},{},[406],{"type":30,"value":407},"Upon completion of the specification, OMA staff reviews the specification and presents it to the Board of Directors for ratification and publication.",{"type":21,"tag":100,"props":409,"children":410},{},[411],{"type":30,"value":412},"Specifications are publicly available at no cost following the board ratification.",{"type":21,"tag":100,"props":414,"children":415},{},[416],{"type":30,"value":417},"We use TestFests for testing interoperability of implementations.",{"type":21,"tag":100,"props":419,"children":420},{},[421],{"type":30,"value":422},"Maintenance involves feedback from developers, results from TestFests, as well as working group discussions.",{"type":21,"tag":100,"props":424,"children":425},{},[426],{"type":30,"value":427},"Open source implementations of the specification exist, which provide valuable input for developers and researchers.",{"type":21,"tag":217,"props":429,"children":431},{"id":430},"references",[432],{"type":30,"value":433},"References",{"type":30,"value":435},"\n\n\n\n\n\n\n\n\n\n\n\n\n\n",{"type":21,"tag":437,"props":438,"children":439},"table",{},[440,459],{"type":21,"tag":441,"props":442,"children":443},"thead",{},[444],{"type":21,"tag":445,"props":446,"children":447},"tr",{},[448,454],{"type":21,"tag":449,"props":450,"children":451},"th",{},[452],{"type":30,"value":453},"Reference",{"type":21,"tag":449,"props":455,"children":456},{},[457],{"type":30,"value":458},"Information",{"type":21,"tag":460,"props":461,"children":462},"tbody",{},[463],{"type":21,"tag":445,"props":464,"children":465},{},[466,475],{"type":21,"tag":467,"props":468,"children":469},"td",{},[470],{"type":21,"tag":236,"props":471,"children":472},{},[473],{"type":30,"value":474},"LwM2Mv1.0.2",{"type":21,"tag":467,"props":476,"children":477},{},[478,480],{"type":30,"value":479},"OMA, “Lightweight Machine to Machine (LwM2M) Technical Specifications, Version 1.0.2”, February 2018. URL: ",{"type":21,"tag":481,"props":482,"children":486},"a",{"href":483,"rel":484},"http://www.openmobilealliance.org/release/LightweightM2M/V1_0_2-20180209-A/",[485],"nofollow",[487],{"type":30,"value":483},{"type":21,"tag":489,"props":490,"children":491},"br",{},[],{"type":30,"value":493},"\n[LwM2Mv1.1.1]\t| OMA, “Lightweight Machine to Machine (LwM2M) Technical Specifications, Version 1.1.1”, June 2019. URL: [http://www.openmobilealliance.org/release/LightweightM2M/V1_1_1-20190617-A/](http://www.openmobilealliance.org/release/LightweightM2M/V1_1_1-20190617-A/)\n",{"type":21,"tag":489,"props":495,"children":496},{},[],{"type":30,"value":498},"\n[LwM2Mv1.2]\t| OMA, “Lightweight Machine to Machine (LwM2M) Technical Specifications, Version 1.2”, November 2020. URL: [http://www.openmobilealliance.org/release/LightweightM2M/V1_2-20201110-A/](http://www.openmobilealliance.org/release/LightweightM2M/V1_2-20201110-A/)\n",{"type":21,"tag":489,"props":500,"children":501},{},[],{"type":30,"value":503},"\n[RFC3552]\t| Rescorla, E. and B. Korver, “Guidelines for Writing RFC Text on Security Considerations”, RFC 3552, July 2003. URL: [https://tools.ietf.org/html/rfc3552](https://tools.ietf.org/html/rfc3552)\n",{"type":21,"tag":489,"props":505,"children":506},{},[],{"type":30,"value":508},"\n[ENISA]\t| ENISA, “Guidelines for Securing the Internet of Things”, November, 2020. URL: [https://www.enisa.europa.eu/publications/guidelines-for-securing-the-internet-of-things](https://www.enisa.europa.eu/publications/guidelines-for-securing-the-internet-of-things)",{"title":7,"searchDepth":510,"depth":510,"links":511},2,[512,514],{"id":57,"depth":513,"text":60},3,{"id":188,"depth":513,"text":191},"markdown","content:5.news:articles:2021-05-19-ENISA-lw2m2-wp.md","content","5.news/articles/2021-05-19-ENISA-lw2m2-wp.md","md",[521,636,687,759,787,858,872,893,896,899,902,905],{"title":522,"_path":523,"children":524},"OMASPECWORKS","/omaspecworks",[525,562,576,628,634],{"title":526,"_path":527,"children":528},"About","/omaspecworks/about",[529,531,543,560],{"title":12,"_path":530},"/omaspecworks/about/omaspecworks",{"title":532,"_path":533,"children":534},"Intelectual Property Rights","/omaspecworks/about/ipr",[535,538,541],{"title":536,"_path":537},"Members IPR","/omaspecworks/about/ipr/members",{"title":539,"_path":540},"Non Members IPR","/omaspecworks/about/ipr/non-members",{"title":542,"_path":533},"Intellectual Property Rights",{"title":544,"_path":545,"children":546},"Policies & Terms","/omaspecworks/about/policies-terms",[547,550,553,556,559],{"title":548,"_path":549},"Use Agreement","/omaspecworks/about/policies-terms/use-agreement",{"title":551,"_path":552},"Trade Marks","/omaspecworks/about/policies-terms/trademarks",{"title":554,"_path":555},"Openness Policy","/omaspecworks/about/policies-terms/openness",{"title":557,"_path":558},"OMA Meeting Guest Policy","/omaspecworks/about/policies-terms/guest-policy",{"title":544,"_path":545},{"title":561,"_path":527},"About OMA SpecWorks",{"title":563,"_path":564,"children":565},"Membership","/omaspecworks/membership",[566,569,572,575],{"title":567,"_path":568},"Join OMA","/omaspecworks/membership/join",{"title":570,"_path":571},"Benefits","/omaspecworks/membership/benefits",{"title":573,"_path":574},"Members","/omaspecworks/membership/members",{"title":563,"_path":564},{"title":577,"_path":578,"children":579},"Collaborate","/omaspecworks/collaborate",[580,583,586,626],{"title":581,"_path":582},"Working Groups","/omaspecworks/collaborate/working-groups",{"title":584,"_path":585},"Liaison Agreements","/omaspecworks/collaborate/liaison-agreements",{"title":587,"_path":588,"children":589},"Affiliates","/omaspecworks/collaborate/affiliates",[590,595,600,605,610,615,620,625],{"title":591,"_path":592,"children":593},"Location Interoperatility","/omaspecworks/collaborate/affiliates/location-interoperability",[594],{"title":591,"_path":592},{"title":596,"_path":597,"children":598},"Mobile Games Interoperability","/omaspecworks/collaborate/affiliates/mobile-games-interoperability",[599],{"title":596,"_path":597},{"title":601,"_path":602,"children":603},"Mobile Wireless Internet Forum","/omaspecworks/collaborate/affiliates/mobile-wireless-internet-forum",[604],{"title":601,"_path":602},{"title":606,"_path":607,"children":608},"SyncML","/omaspecworks/collaborate/affiliates/syncml",[609],{"title":606,"_path":607},{"title":611,"_path":612,"children":613},"WAP Forum","/omaspecworks/collaborate/affiliates/wap-forum",[614],{"title":611,"_path":612},{"title":616,"_path":617,"children":618},"Wireless Village","/omaspecworks/collaborate/affiliates/wireless-village",[619],{"title":616,"_path":617},{"title":621,"_path":622,"children":623},"InLocation Alliance","/omaspecworks/collaborate/affiliates/in-location-alliance",[624],{"title":621,"_path":622},{"title":587,"_path":588},{"title":627,"_path":578},"Collaborate with OMASpecWorks",{"title":629,"_path":630,"children":631},"Get Involved","/omaspecworks/get-involved",[632],{"title":633,"_path":630},"Get Involved with OMA",{"title":635,"_path":523},"Welcome to OMASPECWORKS",{"title":637,"_path":638,"children":639},"SPECIFICATIONS","/specifications",[640,654,668,686],{"title":641,"_path":642,"children":643},"Search","/specifications/search",[644,645,648,651],{"title":641,"_path":642},{"title":646,"_path":647},"by Specifications","/specifications/search/specifications",{"title":649,"_path":650},"by Enablers","/specifications/search/enablers",{"title":652,"_path":653},"by Public Documents","/specifications/search/public-docs",{"title":655,"_path":656,"children":657},"OMNA Registries","/specifications/registries",[658,663,666],{"title":659,"_path":660,"children":661},"Enabler Registries","/specifications/registries/enablers",[662],{"title":659,"_path":660},{"title":664,"_path":665},"Supporting Data","/specifications/registries/supporting-data",{"title":667,"_path":656},"OMNA Registries Overview",{"title":669,"_path":670,"children":671},"OMA Inventory API","/specifications/api",[672,675,678,681,684],{"title":673,"_path":674},"Abstract Protocol Binding","/specifications/api/abstract",{"title":676,"_path":677},"RESTful API","/specifications/api/http",{"title":679,"_path":680},"SOAP Web Services APIs","/specifications/api/soap",{"title":682,"_path":683},"LDAP APIs","/specifications/api/webidl",{"title":685,"_path":670},"OMA Enablers API's",{"title":637,"_path":638},{"title":688,"_path":689,"children":690},"LwM2M","/lwm2m",[691,705,716,744,755,757],{"title":692,"_path":693,"children":694},"What is LwM2M","/lwm2m/whatis",[695,698,701,704],{"title":696,"_path":697},"LwM2M Components","/lwm2m/whatis/components",{"title":699,"_path":700},"Key Features","/lwm2m/whatis/key-features",{"title":702,"_path":703},"LwM2M Benefits","/lwm2m/whatis/benefits",{"title":692,"_path":693},{"title":706,"_path":707,"children":708},"Applications & Use Cases","/lwm2m/applications-use-cases",[709,712,715],{"title":710,"_path":711},"Industry Use Cases","/lwm2m/applications-use-cases/use-cases",{"title":713,"_path":714},"Industrial Applications","/lwm2m/applications-use-cases/industrial-applications",{"title":706,"_path":707},{"title":717,"_path":718,"children":719},"LwM2M Resources & Tools","/lwm2m/resources",[720,734,737,740,743],{"title":721,"_path":722,"children":723},"LwM2M Registry","/lwm2m/resources/registry",[724,727,730,733],{"title":725,"_path":726},"Objects","/lwm2m/resources/registry/objects",{"title":728,"_path":729},"Resources","/lwm2m/resources/registry/resources",{"title":731,"_path":732},"Vendor Bulk Reservations","/lwm2m/resources/registry/vendor-bulk-reservations",{"title":721,"_path":722},{"title":735,"_path":736},"LwM2M Specifications","/lwm2m/resources/specifications",{"title":738,"_path":739},"LwM2M Enablers","/lwm2m/resources/lwm2m-enablers",{"title":741,"_path":742},"Tutorials & Guidelines","/lwm2m/resources/tutorials-guidelines",{"title":717,"_path":718},{"title":745,"_path":746,"children":747},"Community & Events","/lwm2m/community",[748,751,754],{"title":749,"_path":750},"LwM2M Implementations","/lwm2m/community/implementations",{"title":752,"_path":753},"LwM2M Product Listing","/lwm2m/community/product-listing",{"title":745,"_path":746},{"title":629,"_path":756},"/lwm2m/get-involved",{"title":758,"_path":689},"About LwM2M",{"title":760,"_path":761,"children":762},"UTILITIES","/utilities",[763,766,780,785],{"title":764,"_path":765},"Introduction","/utilities/introduction",{"title":767,"_path":768,"children":769},"Market Potential","/utilities/market-potential",[770,773,776,779],{"title":771,"_path":772},"Use Cases","/utilities/market-potential/use-cases",{"title":774,"_path":775},"LwM2M Utilities Benefits","/utilities/market-potential/whitepaper-lwm2m-utilities-benefits",{"title":777,"_path":778},"LwM2M Metering Use Case","/utilities/market-potential/whitepaper-lwm2m-metering-use-case",{"title":767,"_path":768},{"title":781,"_path":782,"children":783},"Promoting LwM2M for Utilities","/utilities/promotion",[784],{"title":7,"_path":782},{"title":786,"_path":761},"LwM2M for Utilities",{"title":788,"_path":789,"children":790},"NEWS","/news",[791,857],{"title":792,"_path":793,"children":794},"Articles","/news/articles",[795,798,801,804,805,808,811,814,817,820,823,826,829,832,835,838,841,844,847,850,853,856],{"title":796,"_path":797},"White Paper - OMA LwM2M - Ready for 5G","/news/articles/2020-01-23-lwm2m-5g",{"title":799,"_path":800},"LwM2M v1.2 is now available!","/news/articles/2020-12-09-lwm2m-release",{"title":802,"_path":803},"uCIFI Alliance Contributes 29 Objects to OMA","/news/articles/2021-03-02-ucifi",{"title":8,"_path":4},{"title":806,"_path":807},"LwM2M in ENISA’s Secure Supply Chain for IoT","/news/articles/2021-07-8-enisa",{"title":809,"_path":810},"LwM2M Objects for nuSIM Integrated SIM","/news/articles/2022-04-12-nusim_objects",{"title":812,"_path":813},"Advanced LwM2M Firmware Update Object","/news/articles/2022-05-30-advance-firmware-update-lwm2m-object",{"title":815,"_path":816},"LwM2M, Bootstrapping in Cellular Networks","/news/articles/2022-06-14-bootstrapping-cellular-networks",{"title":818,"_path":819},"OMA LwM2M v1.2.1 Release","/news/articles/2022-12-09-release-v1_2_1",{"title":821,"_path":822},"IoT and LwM2M for Utilities","/news/articles/2023-06-09-iot-utilities-outreach-post-workshop",{"title":824,"_path":825},"Unlocking Utility Benefits with LwM2M","/news/articles/2023-10-03-outreach-utility-november",{"title":827,"_path":828},"Virtual Test Event","/news/articles/2023-10-16-sve-40-virtual-test-event-nov-23",{"title":830,"_path":831},"A Tailored Solution for Utilities","/news/articles/2023-10-19-unlocking-utility-benefits-with-lwm2m-nov-15",{"title":833,"_path":834},"Revolutionizing the Utilities Sector - The Transformative Power of LwM2M","/news/articles/2024-02-13-utility-webinar-feb-8",{"title":836,"_path":837},"Harnessing the Power of Automation and IoT in the Utilities Industry","/news/articles/2024-05-22-blog-post-sve_41",{"title":839,"_path":840},"OMA SpecWorks Announces LwM2M Test Event to Enable M2M and IoT Use Cases","/news/articles/2024-05-22-release-sve_41",{"title":842,"_path":843},"Industrial Automation: Connecting Operations, People, Machines","/news/articles/2024-07-05-sve_41-blog-industrial-automation",{"title":845,"_path":846},"Optimizing IoT Device Management: Top 3 Key Considerations","/news/articles/2024-07-27-blog-optimizing-iot",{"title":848,"_path":849},"The Emergence of Intelligent Transportation, Riding Smart","/news/articles/2024-07-29-sve_41-blog-intelligent-transportation",{"title":851,"_path":852},"MQTT vs LwM2M: The Battle of IoT Protocols for Lightweight Connectivity and Secure Device Management","/news/articles/2024-09-27-sve_42-blog-mqtt-vs-lwm2m",{"title":854,"_path":855},"OMA SpecWorks Announces LwM2M Test Event to be Held in Düsseldorf, Germany","/news/articles/2024-09-28-release-sve_42",{"title":792,"_path":793},{"title":792,"_path":789},{"title":859,"_path":860,"children":861},"EVENTS","/oma-events",[862,865,868,871],{"title":863,"_path":864},"Test Events","/oma-events/test-events",{"title":866,"_path":867},"Workshops","/oma-events/webinar-workshops",{"title":869,"_path":870},"Member's Meeting","/oma-events/members-meetings",{"title":859,"_path":860},{"title":873,"_path":874,"children":875},"TOOLS","/tools",[876,879,882,885,888,891],{"title":877,"_path":878},"LwM2M API Registry","/tools/lwm2m-api-registry",{"title":880,"_path":881},"LwM2M Editor | Validator","/tools/lwm2m-editor-validator",{"title":883,"_path":884},"LwM2M Developer's Tool Kit","/tools/lwm2m-tool-kit",{"title":886,"_path":887},"LwM2M Guidelines","/tools/lwm2m-guidelines",{"title":889,"_path":890},"LwM2M Validation Error Codes","/tools/validation-errors",{"title":892,"_path":874},"LwM2M TOOLS",{"title":894,"_path":895},"Contact Us","/contact-us",{"title":897,"_path":898},"Frequently Asked Questions","/faq",{"title":900,"_path":901},"Open Mobile Alliance","/",{"title":903,"_path":904},"Landing Page Floaters","/landing-page-floaters",{"title":906,"_path":907},"Newsletter","/newsletter",1733856912996]