[{"_path":"/omaspecworks/membership","_dir":"omaspecworks","_draft":false,"_partial":false,"_locale":"","title":"Membership","description":null,"layout":"doc","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"OMA SpecWorks is a leading Standards Development Organization (SDO) that brings together an experienced body of wireless industry contributors dedicated to creating and refining essential specifications at the service layer. These specifications support billions of fixed and mobile terminals across a diverse range of networks, including traditional cellular and the rapidly expanding Internet of Things (IoT) networks. Notably, OMA SpecWorks has been instrumental in the development of key protocols like the OMA LightweightM2M (LwM2M), which is crucial for enabling seamless machine-to-machine communication. The organization prides itself on fostering a work environment that values input from companies of all sizes, ensuring transparency and equal opportunities for all members to shape the future of wireless communication."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Membership in OMA SpecWorks offers companies an unparalleled opportunity to contribute directly to ongoing working groups or to initiate new projects tailored to their strategic goals. With a streamlined process that effectively balances the need for industry consensus with the urgency of bringing products to market, OMA SpecWorks empowers members to complete work items efficiently. Whether your company is a large corporation or a start-up, OMA SpecWorks provides the tools and collaborative environment necessary to develop high-quality technical outputs, particularly in key areas like IoT device management through protocols such as LwM2M."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Join OMA SpecWorks today and be part of the future of wireless communication"}]},{"type":"text","value":". Visit "},{"type":"element","tag":"a","props":{"href":"/omaspecworks/membership/join"},"children":[{"type":"text","value":"Join OMA"}]},{"type":"text","value":" to learn more and start your membership journey."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:1.omaspecworks:2.membership:index.md","_source":"content","_file":"1.omaspecworks/2.membership/index.md","_extension":"md"},{"_path":"/omaspecworks/collaborate/working-groups","_dir":"collaborate","_draft":false,"_partial":false,"_locale":"","title":"Working Groups","description":null,"layout":"doc","body":{"type":"root","children":[{"type":"element","tag":"h2","props":{"id":"open-mobile-alliance-lightweight-machine-to-machine-lwm2m"},"children":[{"type":"text","value":"Open Mobile Alliance - Lightweight Machine to Machine (LwM2M)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"These GitHub pages are dedicated to DMSE/IPSO Working Groups\n"},{"type":"element","tag":"a","props":{"href":"https://technical.openmobilealliance.org/Overviews/lightweightm2m_overview.html","rel":["nofollow"],"target":"_blank"},"children":[{"type":"text","value":"Specifications"}]},{"type":"text","value":"\nand "},{"type":"element","tag":"a","props":{"href":"https://technical.openmobilealliance.org/OMNA/LwM2M/LwM2MRegistry.html","rel":["nofollow"],"target":"_blank"},"children":[{"type":"text","value":"OMNA LwM2M Registry"}]}]},{"type":"element","tag":"h3","props":{"id":"device-management-smart-objects-dmso"},"children":[{"type":"text","value":"Device Management & Smart Objects (DMSO)"}]},{"type":"element","tag":"sh-text-img","props":{":ui":"{\"wrapper\":\"shadow-xl bg-white\"}","alignText":"left","positionText":"right","spanText":"m","subtitle":"DMSO\n","text":"The Device Management & Smart Objects Working Group (DMSO WG) designed and\nmaintains the Lightweight M2M (LwM2M) protocol that is used to manage mobile\ndevices, service access and software on connected devices across Internet of\nThings (IoT) networks.\n\nSince 2002, the DMSE WG has released a suite of specifications which includes\n20+ mobile service enabler specifications and more than 60 Management Objects\nproviding simple, reliable and cost-effective ways to deploy new applications\nand services while minimizing the risk. The most market diffused of the\nManagement Objects is certainly the Firmware Update Management Object (FUMO)\nwith **deployments in the billions of devices**. An additional 20+ Management\nObjects have been defined by other standards organizations, which cooperate\nwith OMA SpecWorks to avoid fragmentation and duplication. DMSE technologies\neasily manage converged and multi-mode devices on any network, including\ndevices that do not have a SIM card, as well as resource-constrained devices.\nExplore the OMA [DMSO](https://technical.openmobilealliance.org/index.html){target=\"_blank\"}\nand [LwM2M](https://openmobilealliance.github.io/dmse-documentation/){target=\"_blank\"} specifications.\n","urlImage":"/images/lwm2m/working_together_1.jpg","title":""},"children":[]},{"type":"element","tag":"h3","props":{"id":"ipso-smart-objects-working-group-ipso"},"children":[{"type":"text","value":"IPSO Smart Objects Working Group (IPSO)"}]},{"type":"element","tag":"sh-text-img","props":{":ui":"{\"wrapper\":\"shadow-xl mt-10 bg-white\"}","alignText":"left","positionText":"left","spanText":"m","subtitle":"IPSO\n","text":"In December 2017, the IPSO Alliance joined forces with the Open Mobile Alliance.\nOMA SpecWorks was launched in early 2018 from the two organizations and the IPSO\nSmart Objects Working Group (IPSO WG) was formed. The IPSO WG is focused on\nenabling IoT devices to communicate, understand and trust each other with global\ninteroperability based on open standards.\n\nIPSO WG’s charter is to develop, establish, and create the industry leadership\nof an “IPSO Platform” that includes the definition and support of Smart Objects\nwith an emphasis on object interoperability on protocol and data layers and of\nIdentity and Privacy technologies. The mission is to create a platform and\nsupport system that includes libraries, repositories, design kits, and industry\nawareness for discovery and interoperability of IoT Smart Objects.\n\nThe IPSO Alliance is not a standards organization, but an alliance that\npromotes and supports Smart Objects, and manages an IPSO Smart Object Registry\nthat includes libraries, icons and repositories to be used by worldwide standard\ndefinition organizations (SDOs), special interest groups (SIGs), open\ncommunities and original equipment manufacturers (OEMs). The creation of a fully\nfunctional IPSO Smart Object Registry provides an avenue for industry adoption.\nIPSO has the goal to create Smart Object definitions, instantiations, data\nmodels, design models, reference architectures, icons, and brand, which include\nall the attributes needed to be an integral component of an IoT Smart Object Marketplace.\n","urlImage":"/images/lwm2m/working_together_2.jpg",":title":"null"},"children":[]},{"type":"element","tag":"h3","props":{"id":"about-oma-specworks"},"children":[{"type":"text","value":"About OMA SpecWorks"}]},{"type":"element","tag":"sh-alert","props":{},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"OMA SpecWorks is an innovative kind of Standards Development Organization\n(SDO) where the needs for wireless industry consensus versus the quick and\naccurate creation of specifications and other technical documentation are\nbalanced via a working group-driven, efficient and "},{"type":"element","tag":"a","props":{"href":"https://omaspecworks.org/what-is-oma-specworks/agile-process-for-standardization-in-todays-market-landscape/","rel":["nofollow"]},"children":[{"type":"text","value":"agile process"}]},{"type":"text","value":".\nAs a non-profit organization with a long history in mobile and Internet of\nThings (IoT) technology development, OMA SpecWorks is a specifications factory\nwhere industry-leading companies bring their ideas and talent to build\nmarket-accelerating standards that allow products and services to interoperate\nseamlessly across fixed and mobile wireless data networks."}]}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"open-mobile-alliance-lightweight-machine-to-machine-lwm2m","depth":2,"text":"Open Mobile Alliance - Lightweight Machine to Machine (LwM2M)","children":[{"id":"device-management-smart-objects-dmso","depth":3,"text":"Device Management & Smart Objects (DMSO)"},{"id":"ipso-smart-objects-working-group-ipso","depth":3,"text":"IPSO Smart Objects Working Group (IPSO)"},{"id":"about-oma-specworks","depth":3,"text":"About OMA SpecWorks"}]}]}},"_type":"markdown","_id":"content:1.omaspecworks:3.collaborate:10.working-groups.md","_source":"content","_file":"1.omaspecworks/3.collaborate/10.working-groups.md","_extension":"md"}]