[{"data":1,"prerenderedAt":852},["ShallowReactive",2],{"docs-/omaspecworks/about/policies-terms/use-agreement":3,"navigation":274,"$mRaHnBkTJj":659},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"layout":10,"body":11,"_type":269,"_id":270,"_source":271,"_file":272,"_extension":273},"/omaspecworks/about/policies-terms/use-agreement","policies-terms",false,"","Use Agreement",null,"doc",{"type":12,"children":13,"toc":255},"root",[14,22,29,34,40,45,51,56,61,66,71,76,82,87,93,98,103,108,113,119,124,129,135,149,155,160,166,171,177,182,187,192,228,230,235,240,245,250],{"type":15,"tag":16,"props":17,"children":18},"element","p",{},[19],{"type":20,"value":21},"text","IMPORTANT: PLEASE READ THIS USE AGREEMENT ('AGREEMENT') CAREFULLY. THE OPEN MOBILE ALLIANCE. ('OPEN MOBILE ALLIANCE') PROVIDES ACCESS TO CERTAIN DOCUMENTS TO YOU, YOUR EMPLOYEES, AGENTS, AND CONTRACTORS, AND ANY OTHER ENTITY ON WHOSE BEHALF YOU ACCEPT THIS AGREEMENT (COLLECTIVELY 'YOU'), SUBJECT TO THIS AGREEMENT. THIS AGREEMENT IS ENTERED INTO BY AND BETWEEN THE OPEN MOBILE ALLIANCE AND YOU. BY CLICKING BELOW AFTER THE FULL TEXT THE 'AGREE' BUTTON YOU AGREE TO BE BOUND BY THE TERMS OF THIS AGREEMENT. IF YOU DO NOT AGREE TO THE TERMS OF THIS AGREEMENT, CLICK THE 'DO NOT AGREE' BUTTON. IF YOU CLICK THE 'DO NOT AGREE' BUTTON, YOU WILL NOT BE PROVIDED ACCESS TO THE DOCUMENTS AND AGREE THAT YOU WILL HAVE NO RIGHT TO USE THE DOCUMENTS OR THE INFORMATION CONTAINED THEREIN.",{"type":15,"tag":23,"props":24,"children":26},"h3",{"id":25},"license",[27],{"type":20,"value":28},"License",{"type":15,"tag":16,"props":30,"children":31},{},[32],{"type":20,"value":33},"The Open Mobile Alliance grants you a non-exclusive, royalty-free license to download, reproduce and use the information contained in electronic files at ('Documents') subject to the terms and conditions of this Agreement. You acquire no intellectual or industrial property rights under this Agreement or through any disclosure hereunder except as expressly stated in this Agreement. No license to any patent, trademark, copyright or other proprietary right is granted under this Agreement or through any disclosure hereunder except as expressly stated in this Agreement.",{"type":15,"tag":23,"props":35,"children":37},{"id":36},"documents-terms-of-use",[38],{"type":20,"value":39},"Documents – Terms of Use",{"type":15,"tag":16,"props":41,"children":42},{},[43],{"type":20,"value":44},"You agree to abide by all of the terms and conditions set forth in the OMA Website Terms of Use. Permission is granted under this Agreement to download the Documents owned by the Open Mobile Alliance on this Website, and to use the information set forth in the Documents internally only, provided that: (a) the copyright notice pertaining to the Documents remains on any copies of the materials; (b) the use of such Documents is solely for personal and non-commercial use, provided, however, that information contained in clearly designated final approved Open Mobile Alliance specifications may be used for commercial purposes; (c) such Documents will not be copied or posted on any networked computer or published in any medium, except as explicitly permitted by valid permission or license covering such materials; and (d) no modifications are made to such Documents. This permission terminates automatically without notice if You breach any of the terms or conditions in this section 2. Upon termination, You must immediately destroy any downloaded and/or printed Documents. In case of conflict between this Agreement and the OMA Website Terms of Use, this Agreement will control.",{"type":15,"tag":23,"props":46,"children":48},{"id":47},"intellectual-property-rights",[49],{"type":20,"value":50},"Intellectual Property Rights",{"type":15,"tag":16,"props":52,"children":53},{},[54],{"type":20,"value":55},"In the course of specifications work, the Open Mobile Alliance receives contributions in various forms. To best facilitate the dissemination of these contributions, it is necessary to understand any intellectual property rights (‘IPR’) relating to the contributions.",{"type":15,"tag":16,"props":57,"children":58},{},[59],{"type":20,"value":60},"Each Open Mobile Alliance member has agreed to use reasonable endeavors to inform the Open Mobile Alliance in a timely manner of Essential IPR as it becomes aware that the Essential IPR is related to the prepared or published specification. However, the members do not have an obligation to conduct IPR searches. The information received by the members is publicly available to members and non-members of the Open Mobile Alliance and may be found on the 'OMA IPR Declarations' list. Essential IPR is defined and is available for license as set forth in the schedule to the Open Mobile Alliance Application Form.",{"type":15,"tag":16,"props":62,"children":63},{},[64],{"type":20,"value":65},"Your acceptance of this Agreement does not allow you to provide any contribution of information, whether such contains or does not contain IPR, to the Documents unless you are a member of the Open Mobile Alliance. All contributions must be made pursuant to the membership policies of the Open Mobile Alliance, including but not limited to its IPR policies.",{"type":15,"tag":16,"props":67,"children":68},{},[69],{"type":20,"value":70},"In the event that You do provide any content in connection with this Website, it shall be deemed to be provided on a non-confidential basis. The Open Mobile Alliance shall be free to use or disseminate such content and any underlying rights related to such content on an unrestricted basis for any purpose, and You grant the Open Mobile Alliance, its members and all other users of the Website an irrevocable, worldwide, royalty-free, nonexclusive license to use, reproduce, modify, distribute, transmit, display, perform, adapt, resell and publish such content and any underlying rights related to such content (including in digital form). You represent and warrant that you have proper authorization for the worldwide transfer and processing among the Open Mobile Alliance, its members, and third party providers of any information that You may provide on the Website. Nothing contained herein shall be deemed to obligate the Open Mobile Alliance or its members to use or disseminate Your content or any underlying rights related to such content.",{"type":15,"tag":16,"props":72,"children":73},{},[74],{"type":20,"value":75},"You acknowledge and agree that (i) the Open Mobile Alliance has not conducted an independent IPR review of the Documents and the information contained therein, and makes no representations or warranties regarding third party IPR, including without limitation patents, copyrights or trade secret rights; and (ii) the Documents may contain inventions for which You must obtain licenses from third parties before making, using or selling the inventions.",{"type":15,"tag":23,"props":77,"children":79},{"id":78},"indemnity",[80],{"type":20,"value":81},"Indemnity",{"type":15,"tag":16,"props":83,"children":84},{},[85],{"type":20,"value":86},"You agree to indemnify and hold the Open Mobile Alliance and its officers, directors, agents, members, employees, attorneys and representatives harmless from any claim or demand, including reasonable attorneys’ fees, made by any third party due to or arising out of Your use of or connection to the Website, Your violation of this Agreement, Your use of the Documents and the information contained in the Documents.",{"type":15,"tag":23,"props":88,"children":90},{"id":89},"disclaimer-of-warranties",[91],{"type":20,"value":92},"Disclaimer of Warranties",{"type":15,"tag":16,"props":94,"children":95},{},[96],{"type":20,"value":97},"YOUR USE OF THE DOCUMENTS AND THE INFORMATION CONTAINED IN THE DOCUMENTS IS AT YOUR SOLE RISK. THE DOCUMENTS ARE PROVIDED ON AN 'AS IS' 'AS AVAILABLE' AND 'WITH ALL FAULTS' BASIS. THE OPEN MOBILE ALLIANCE DISCLAIMS ALL EXPRESS OR IMPLIED CONDITIONS, REPRESENTATIONS, AND WARRANTIES OF ANY KIND, INCLUDING ANY IMPLIED WARRANTY OR CONDITION OF MERCHANTABILITY, SATISFACTORY QUALITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT. THE OPEN MOBILE ALLIANCE MAKES NO REPRESENTATIONS, WARRANTIES, CONDITIONS OR GUARANTEES AS TO THE USEFULNESS, QUALITY, SUITABILITY, TRUTH, ACCURACY OR COMPLETENESS OF THE DOCUMENTS AND THE INFORMATION CONTAINED IN THE DOCUMENTS.",{"type":15,"tag":16,"props":99,"children":100},{},[101],{"type":20,"value":102},"THE OPEN MOBILE ALLIANCE MAKES NO WARRANTY OR REPRESENTATION THAT: (a) THE WEB SITE WILL BE UNINTERRUPTED, TIMELY, SECURE, OR ERROR-FREE; (b) THE RESULTS THAT MAY BE OBTAINED FROM THE USE OF THE WEB SITE WILL BE ACCURATE OR RELIABLE; (c) ANY DOCUMENTS AND THE INFORMATION CONTAINED IN THE DOCUMENTS OBTAINED FROM THE WEB SITE WILL MEET YOUR EXPECTATIONS OR REQUIREMENTS; OR (d) ANY ERRORS IN THE WEB SITE WILL BE CORRECTED.",{"type":15,"tag":16,"props":104,"children":105},{},[106],{"type":20,"value":107},"THE OPEN MOBILE ALLIANCE MAKES NO WARRANTY OR REPRESENTATION THAT: (a) THE WEB SITE WILL BE UNINTERRUPTED, TIMELY, SECURE, OR ERROR-FREE; (b) THE RESULTS THAT MAY BE OBTAINED FROM THE USE OF THE WEB SITE WILL BE ACCURATE OR RELIABLE; (c) ANY DOCUMENTS AND THE INFORMATION CONTAINED IN THE DOCUMENTS OBTAINED FROM THE WEB SITE WILL MEET YOUR EXPECTATIONS OR REQUIREMENTS; OR (d) ANY ERRORS IN THE WEB SITE WILL BE CORRECTED. YOU ASSUME ALL RISK FOR ANY DAMAGE TO YOUR COMPUTER SYSTEM OR LOSS OF DATA THAT RESULTS FROM OBTAINING ANY DOCUMENTS FROM THE WEB SITE, INCLUDING ANY DAMAGES RESULTING FROM COMPUTER VIRUSES.",{"type":15,"tag":16,"props":109,"children":110},{},[111],{"type":20,"value":112},"NO ORAL OR WRITTEN STATEMENT BY THE OPEN MOBILE ALLIANCE OR BY A REPRESENTATIVE OF THE OPEN MOBILE ALLIANCE SHALL CREATE A WARRANTY OR INCREASE THE SCOPE OF THIS WARRANTY.",{"type":15,"tag":23,"props":114,"children":116},{"id":115},"limitation-of-liability",[117],{"type":20,"value":118},"Limitation of Liability",{"type":15,"tag":16,"props":120,"children":121},{},[122],{"type":20,"value":123},"TO THE FULL EXTENT PERMITTED BY LAW, THE OPEN MOBILE ALLIANCE IS NOT LIABLE FOR AND HEREBY DISCLAIMS ANY DIRECT, INDIRECT, PUNITIVE, SPECIAL, INCIDENTAL, CONSEQUENTIAL, OR EXEMPLARY DAMAGES (INCLUDING, WITHOUT LIMITATION, LOSS OF BUSINESS, REVENUE, PROFITS, GOODWILL, USE, DATA, OR OTHER ECONOMIC ADVANTAGE) ARISING OUT OF OR IN CONNECTION WITH THE WEB SITE AND THE USE OF DOCUMENTS AND THE INFORMATION CONTAINED IN THE DOCUMENTS, EVEN IF OPEN MOBILE ALLIANCE HAS PREVIOUSLY BEEN ADVISED OF, OR REASONABLY COULD HAVE FORESEEN, THE POSSIBILITY OF SUCH DAMAGES, HOWEVER THEY ARISE, WHETHER IN BREACH OF CONTRACT OR IN TORT (INCLUDING NEGLIGENCE), INCLUDING WITHOUT LIMITATION DAMAGES DUE TO: (a) THE USE OF OR THE INABILITY TO USE THE WEB SITE; (b) STATEMENTS OR CONDUCT OF ANY THIRD PARTY ON THE WEB SITE, INCLUDING WITHOUT LIMITATION UNAUTHORIZED ACCESS TO OR ALTERATION OF TRANSMISSIONS OR DATA, MALICIOUS OR CRIMINAL BEHAVIOR, OR FALSE OR FRAUDULENT TRANSACTIONS; OR (c) DOCUMENTS OR INFORMATION YOU MAY DOWNLOAD.",{"type":15,"tag":16,"props":125,"children":126},{},[127],{"type":20,"value":128},"TO THE EXTENT THAT ANY JURISDICTION DOES NOT ALLOW THE EXCLUSION OR LIMITATION OF DIRECT, INCIDENTAL OR CONSEQUENTIAL DAMAGES, PORTIONS OF THE ABOVE LIMITATION OR EXCLUSION MAY NOT APPLY.",{"type":15,"tag":23,"props":130,"children":132},{"id":131},"open-mobile-alliances-privacy-policy",[133],{"type":20,"value":134},"Open Mobile Alliance's Privacy Policy",{"type":15,"tag":16,"props":136,"children":137},{},[138,140,147],{"type":20,"value":139},"You consent to the collection, processing and storage by Open Mobile Alliance of Your personal information in accordance with the terms of the Open Mobile Alliance's Privacy Policy, which is available at ",{"type":15,"tag":141,"props":142,"children":144},"a",{"href":143},"/omaspecworks/about/policies-terms/use-agreement#open-mobile-alliances-privacy-policy",[145],{"type":20,"value":146},"Privacy Policy",{"type":20,"value":148},". You agree to comply with all applicable laws and regulations, and the terms of Open Mobile Alliance's Privacy Policy, with respect to any access, use and/or submission by You of any personal information in connection with this Website.",{"type":15,"tag":23,"props":150,"children":152},{"id":151},"term-and-termination",[153],{"type":20,"value":154},"Term and Termination",{"type":15,"tag":16,"props":156,"children":157},{},[158],{"type":20,"value":159},"Your license to use the Documents and the information contained in the Documents shall commence on the date you click below to agree to this Agreement. You may terminate this Agreement at any time by destroying all copies of the Documents and the information contained in the Documents. All restrictions on use and all other provisions that may reasonably be interpreted to survive termination of this Agreement, will survive termination of this Agreement for any reason. Your license to use the Documents will terminate automatically if You fail to comply with any of the terms and conditions of this Agreement. Upon termination of this Agreement for whatever reason, You agree to cease to make any use of the Documents and the information contained in the Documents.",{"type":15,"tag":23,"props":161,"children":163},{"id":162},"modifications",[164],{"type":20,"value":165},"Modifications",{"type":15,"tag":16,"props":167,"children":168},{},[169],{"type":20,"value":170},"The Open Mobile Alliance reserves the right at any time to modify, suspend or terminate Your use of or access to the Documents and the information contained in the Documents, with or without notice. The Open Mobile Alliance may also delete, or bar access to or use of, all Documents and the information contained in the Documents and files. The Open Mobile Alliance will not be liable to You or any third party for any modification, suspension, or termination of use of the Documents, or loss of related information. The Open Mobile Alliance may amend this Agreement at any time by posting the amended terms on this Website.",{"type":15,"tag":23,"props":172,"children":174},{"id":173},"general-terms",[175],{"type":20,"value":176},"General Terms",{"type":15,"tag":16,"props":178,"children":179},{},[180],{"type":20,"value":181},"This Agreement constitutes the entire agreement between You and the Open Mobile Alliance relating to the subject matter, and cancels and supersedes any prior versions of the Agreement. No modification to the Agreement will be binding, unless in writing and signed by an authorized Open Mobile Alliance representative. You must not assign or otherwise transfer the Agreement or any right granted hereunder.",{"type":15,"tag":16,"props":183,"children":184},{},[185],{"type":20,"value":186},"This Agreement shall be governed by and construed in accordance with the laws of the State of California, U.S.A., without reference to any conflict of law principles, provided, however, that Section 10.3 shall be governed by and interpreted in accordance with the Federal Arbitration Act of the United States, 9 U.S.C. §§ 1 et seq.",{"type":15,"tag":16,"props":188,"children":189},{},[190],{"type":20,"value":191},"Any dispute, claim, controversy or difference regarding the interpretation or validity of, the alleged breach of, or otherwise arising out of or relating to this Agreement shall be resolved by binding arbitration pursuant to this section.",{"type":15,"tag":193,"props":194,"children":195},"ul",{},[196,198,204,205,210,211,216,217,222,223],{"type":20,"value":197},"\n \t",{"type":15,"tag":199,"props":200,"children":201},"li",{},[202],{"type":20,"value":203},"The arbitration shall be held in San Francisco, California before an arbitral tribunal consisting of three arbitrators, who shall be appointed as provided for in the Rules of Arbitration of the International Chamber of Commerce ('ICC'). The arbitration shall be governed by the Rules of Arbitration of the ICC ('Rules'), except as otherwise provided in this section. Notwithstanding any of the ICC Rules to the contrary, the final award in the arbitration shall be rendered no later than the date the request for arbitration is filed.",{"type":20,"value":197},{"type":15,"tag":199,"props":206,"children":207},{},[208],{"type":20,"value":209},"The language of the arbitration shall be English. The decision of, and award rendered by, the arbitral tribunal shall be final and binding on the parties and shall not be subject to appeal. Judgment on the award may be entered in and enforced by any court of competent jurisdiction. Each party shall bear its own costs and expenses (including filing fees) with respect to the arbitration, including one-half of the fees and expenses of the arbitral tribunal; provided, however, that the arbitral tribunal shall have the authority to award, as part of the arbitral tribunal's decision, to the prevailing party its costs and expenses of the arbitration proceeding, including reasonable attorneys' fees and experts' fees.",{"type":20,"value":197},{"type":15,"tag":199,"props":212,"children":213},{},[214],{"type":20,"value":215},"Each of the parties hereby irrevocably submits to the personal jurisdiction of, and irrevocably waives objection to the laying of venue (including a waiver of any argument of forum non conveniens or other principles of like effect) in, the state and federal courts located in San Francisco, California, for the purposes of any action commenced in aid of an arbitration hereunder, for any litigation undertaken for any of the purposes set forth in subsection (d) below, or for entry of judgment upon the arbitral tribunal's award.",{"type":20,"value":197},{"type":15,"tag":199,"props":218,"children":219},{},[220],{"type":20,"value":221},"Because you shall have access to the Documents and other valuable proprietary materials of the Open Mobile Alliance, you agree that in addition to its rights and remedies otherwise available at law, the Open Mobile Alliance shall have the right to enforce this Agreement and any of its provisions in a court of competent jurisdiction by injunction (without being required to show any actual damage or to post an injunction bond), specific performance or any other equitable relief without prejudice to any other rights and remedies that the Open Mobile Alliance may have for the breach of this Agreement.",{"type":20,"value":197},{"type":15,"tag":199,"props":224,"children":225},{},[226],{"type":20,"value":227},"Notwithstanding anything to the contrary, the Open Mobile Alliance shall have the right to elect in its sole discretion the forum for any lawsuit arising hereunder brought by the Open Mobile Alliance.",{"type":20,"value":229},"  \n",{"type":15,"tag":16,"props":231,"children":232},{},[233],{"type":20,"value":234},"If any term or provision of this Agreement shall be found to be invalid, illegal or otherwise unenforceable, such finding shall not effect the other terms or provisions of this Agreement, or the whole of this Agreement, but such term or provision shall be deemed modified to the extent necessary to render such term or provision enforceable, and the rights and obligations of the parties shall be construed and enforced accordingly, preserving to the fullest permissible extent the intent and agreements of the parties set forth in this Agreement.",{"type":15,"tag":16,"props":236,"children":237},{},[238],{"type":20,"value":239},"Documents and the information contained in the Documents derived or obtained from this Website may be subject to the U.S. export laws and the export or import laws of other countries. You agree to comply strictly with all such laws.",{"type":15,"tag":16,"props":241,"children":242},{},[243],{"type":20,"value":244},"Rights and obligations under this Agreement that by their nature should survive will remain in full effect after termination or expiration of the Agreement.",{"type":15,"tag":16,"props":246,"children":247},{},[248],{"type":20,"value":249},"The Documents may contain forward-looking statements. Such forward-looking statements may include statements regarding market expectations and opportunities, research and development and strategies, statements concerning Open Mobile Alliance’s roadmaps and specification development. These forward-looking statements are just predictions and involve risks and uncertainties. Actual results may differ materially from results discussed in the forward-looking statements. Factors that may cause such a difference include risks related to adverse changes in general economic conditions, lack of success in technical advancements, and the timely development, production and acceptance of specifications.",{"type":15,"tag":16,"props":251,"children":252},{},[253],{"type":20,"value":254},"Any express waiver or failure to exercise promptly any right under this Agreement will not create a continuing waiver or any expectation of non-enforcement. If any provision of this Agreement is held invalid by any law or regulation of any government, or by any court or arbitrator, the parties agree that such provision will be replaced with a new provision that accomplishes the original business purpose, and the other provisions of this Agreement will remain in full force and effect.",{"title":7,"searchDepth":256,"depth":256,"links":257},2,[258,260,261,262,263,264,265,266,267,268],{"id":25,"depth":259,"text":28},3,{"id":36,"depth":259,"text":39},{"id":47,"depth":259,"text":50},{"id":78,"depth":259,"text":81},{"id":89,"depth":259,"text":92},{"id":115,"depth":259,"text":118},{"id":131,"depth":259,"text":134},{"id":151,"depth":259,"text":154},{"id":162,"depth":259,"text":165},{"id":173,"depth":259,"text":176},"markdown","content:1.omaspecworks:1.about:20.policies-terms:10.use-agreement.md","content","1.omaspecworks/1.about/20.policies-terms/10.use-agreement.md","md",[275,388,439,511,539,612,626,647,650,653,656],{"title":276,"_path":277,"children":278},"OMASPECWORKS","/omaspecworks",[279,314,328,380,386],{"title":280,"_path":281,"children":282},"About","/omaspecworks/about",[283,286,297,312],{"title":284,"_path":285},"OMA SpecWorks","/omaspecworks/about/omaspecworks",{"title":287,"_path":288,"children":289},"Intelectual Property Rights","/omaspecworks/about/ipr",[290,293,296],{"title":291,"_path":292},"Members IPR","/omaspecworks/about/ipr/members",{"title":294,"_path":295},"Non Members IPR","/omaspecworks/about/ipr/non-members",{"title":50,"_path":288},{"title":298,"_path":299,"children":300},"Policies & Terms","/omaspecworks/about/policies-terms",[301,302,305,308,311],{"title":8,"_path":4},{"title":303,"_path":304},"Trade Marks","/omaspecworks/about/policies-terms/trademarks",{"title":306,"_path":307},"Openness Policy","/omaspecworks/about/policies-terms/openness",{"title":309,"_path":310},"OMA Meeting Guest Policy","/omaspecworks/about/policies-terms/guest-policy",{"title":298,"_path":299},{"title":313,"_path":281},"About OMA SpecWorks",{"title":315,"_path":316,"children":317},"Membership","/omaspecworks/membership",[318,321,324,327],{"title":319,"_path":320},"Join OMA","/omaspecworks/membership/join",{"title":322,"_path":323},"Benefits","/omaspecworks/membership/benefits",{"title":325,"_path":326},"Members","/omaspecworks/membership/members",{"title":315,"_path":316},{"title":329,"_path":330,"children":331},"Collaborate","/omaspecworks/collaborate",[332,335,338,378],{"title":333,"_path":334},"Working Groups","/omaspecworks/collaborate/working-groups",{"title":336,"_path":337},"Liaison Agreements","/omaspecworks/collaborate/liaison-agreements",{"title":339,"_path":340,"children":341},"Affiliates","/omaspecworks/collaborate/affiliates",[342,347,352,357,362,367,372,377],{"title":343,"_path":344,"children":345},"Location Interoperatility","/omaspecworks/collaborate/affiliates/location-interoperability",[346],{"title":343,"_path":344},{"title":348,"_path":349,"children":350},"Mobile Games Interoperability","/omaspecworks/collaborate/affiliates/mobile-games-interoperability",[351],{"title":348,"_path":349},{"title":353,"_path":354,"children":355},"Mobile Wireless Internet Forum","/omaspecworks/collaborate/affiliates/mobile-wireless-internet-forum",[356],{"title":353,"_path":354},{"title":358,"_path":359,"children":360},"SyncML","/omaspecworks/collaborate/affiliates/syncml",[361],{"title":358,"_path":359},{"title":363,"_path":364,"children":365},"WAP Forum","/omaspecworks/collaborate/affiliates/wap-forum",[366],{"title":363,"_path":364},{"title":368,"_path":369,"children":370},"Wireless Village","/omaspecworks/collaborate/affiliates/wireless-village",[371],{"title":368,"_path":369},{"title":373,"_path":374,"children":375},"InLocation Alliance","/omaspecworks/collaborate/affiliates/in-location-alliance",[376],{"title":373,"_path":374},{"title":339,"_path":340},{"title":379,"_path":330},"Collaborate with OMASpecWorks",{"title":381,"_path":382,"children":383},"Get Involved","/omaspecworks/get-involved",[384],{"title":385,"_path":382},"Get Involved with OMA",{"title":387,"_path":277},"Welcome to OMASPECWORKS",{"title":389,"_path":390,"children":391},"SPECIFICATIONS","/specifications",[392,406,420,438],{"title":393,"_path":394,"children":395},"Search","/specifications/search",[396,397,400,403],{"title":393,"_path":394},{"title":398,"_path":399},"by Specifications","/specifications/search/specifications",{"title":401,"_path":402},"by Enablers","/specifications/search/enablers",{"title":404,"_path":405},"by Public Documents","/specifications/search/public-docs",{"title":407,"_path":408,"children":409},"OMNA Registries","/specifications/registries",[410,415,418],{"title":411,"_path":412,"children":413},"Enabler Registries","/specifications/registries/enablers",[414],{"title":411,"_path":412},{"title":416,"_path":417},"Supporting Data","/specifications/registries/supporting-data",{"title":419,"_path":408},"OMNA Registries Overview",{"title":421,"_path":422,"children":423},"OMA Inventory API","/specifications/api",[424,427,430,433,436],{"title":425,"_path":426},"Abstract Protocol Binding","/specifications/api/abstract",{"title":428,"_path":429},"RESTful API","/specifications/api/http",{"title":431,"_path":432},"SOAP Web Services APIs","/specifications/api/soap",{"title":434,"_path":435},"LDAP APIs","/specifications/api/webidl",{"title":437,"_path":422},"OMA Enablers API's",{"title":389,"_path":390},{"title":440,"_path":441,"children":442},"LwM2M","/lwm2m",[443,457,468,496,507,509],{"title":444,"_path":445,"children":446},"What is LwM2M","/lwm2m/whatis",[447,450,453,456],{"title":448,"_path":449},"LwM2M Components","/lwm2m/whatis/components",{"title":451,"_path":452},"Key Features","/lwm2m/whatis/key-features",{"title":454,"_path":455},"LwM2M Benefits","/lwm2m/whatis/benefits",{"title":444,"_path":445},{"title":458,"_path":459,"children":460},"Applications & Use Cases","/lwm2m/applications-use-cases",[461,464,467],{"title":462,"_path":463},"Industry Use Cases","/lwm2m/applications-use-cases/use-cases",{"title":465,"_path":466},"Industrial Applications","/lwm2m/applications-use-cases/industrial-applications",{"title":458,"_path":459},{"title":469,"_path":470,"children":471},"LwM2M Resources & Tools","/lwm2m/resources",[472,486,489,492,495],{"title":473,"_path":474,"children":475},"LwM2M Registry","/lwm2m/resources/registry",[476,479,482,485],{"title":477,"_path":478},"Objects","/lwm2m/resources/registry/objects",{"title":480,"_path":481},"Resources","/lwm2m/resources/registry/resources",{"title":483,"_path":484},"Vendor Bulk Reservations","/lwm2m/resources/registry/vendor-bulk-reservations",{"title":473,"_path":474},{"title":487,"_path":488},"LwM2M Specifications","/lwm2m/resources/specifications",{"title":490,"_path":491},"LwM2M Enablers","/lwm2m/resources/lwm2m-enablers",{"title":493,"_path":494},"Tutorials & Guidelines","/lwm2m/resources/tutorials-guidelines",{"title":469,"_path":470},{"title":497,"_path":498,"children":499},"Community & Events","/lwm2m/community",[500,503,506],{"title":501,"_path":502},"LwM2M Implementations","/lwm2m/community/implementations",{"title":504,"_path":505},"LwM2M Product Listing","/lwm2m/community/product-listing",{"title":497,"_path":498},{"title":381,"_path":508},"/lwm2m/get-involved",{"title":510,"_path":441},"About LwM2M",{"title":512,"_path":513,"children":514},"UTILITIES","/utilities",[515,518,532,537],{"title":516,"_path":517},"Introduction","/utilities/introduction",{"title":519,"_path":520,"children":521},"Market Potential","/utilities/market-potential",[522,525,528,531],{"title":523,"_path":524},"Use Cases","/utilities/market-potential/use-cases",{"title":526,"_path":527},"LwM2M Utilities Benefits","/utilities/market-potential/whitepaper-lwm2m-utilities-benefits",{"title":529,"_path":530},"LwM2M Metering Use Case","/utilities/market-potential/whitepaper-lwm2m-metering-use-case",{"title":519,"_path":520},{"title":533,"_path":534,"children":535},"Promoting LwM2M for Utilities","/utilities/promotion",[536],{"title":7,"_path":534},{"title":538,"_path":513},"LwM2M for Utilities",{"title":540,"_path":541,"children":542},"NEWS","/news",[543,611],{"title":544,"_path":545,"children":546},"Articles","/news/articles",[547,550,553,556,559,562,565,568,571,574,577,580,583,586,589,592,595,598,601,604,607,610],{"title":548,"_path":549},"White Paper - OMA LwM2M - Ready for 5G","/news/articles/2020-01-23-lwm2m-5g",{"title":551,"_path":552},"LwM2M v1.2 is now available!","/news/articles/2020-12-09-lwm2m-release",{"title":554,"_path":555},"uCIFI Alliance Contributes 29 Objects to OMA","/news/articles/2021-03-02-ucifi",{"title":557,"_path":558},"LwM2M in ENISA’s Secure Supply Chain for IoT V1.0","/news/articles/2021-05-19-enisa-lw2m2-wp",{"title":560,"_path":561},"LwM2M in ENISA’s Secure Supply Chain for IoT","/news/articles/2021-07-8-enisa",{"title":563,"_path":564},"LwM2M Objects for nuSIM Integrated SIM","/news/articles/2022-04-12-nusim_objects",{"title":566,"_path":567},"Advanced LwM2M Firmware Update Object","/news/articles/2022-05-30-advance-firmware-update-lwm2m-object",{"title":569,"_path":570},"LwM2M, Bootstrapping in Cellular Networks","/news/articles/2022-06-14-bootstrapping-cellular-networks",{"title":572,"_path":573},"OMA LwM2M v1.2.1 Release","/news/articles/2022-12-09-release-v1_2_1",{"title":575,"_path":576},"IoT and LwM2M for Utilities","/news/articles/2023-06-09-iot-utilities-outreach-post-workshop",{"title":578,"_path":579},"Unlocking Utility Benefits with LwM2M","/news/articles/2023-10-03-outreach-utility-november",{"title":581,"_path":582},"Virtual Test Event","/news/articles/2023-10-16-sve-40-virtual-test-event-nov-23",{"title":584,"_path":585},"A Tailored Solution for Utilities","/news/articles/2023-10-19-unlocking-utility-benefits-with-lwm2m-nov-15",{"title":587,"_path":588},"Revolutionizing the Utilities Sector - The Transformative Power of LwM2M","/news/articles/2024-02-13-utility-webinar-feb-8",{"title":590,"_path":591},"Harnessing the Power of Automation and IoT in the Utilities Industry","/news/articles/2024-05-22-blog-post-sve_41",{"title":593,"_path":594},"OMA SpecWorks Announces LwM2M Test Event to Enable M2M and IoT Use Cases","/news/articles/2024-05-22-release-sve_41",{"title":596,"_path":597},"Industrial Automation: Connecting Operations, People, Machines","/news/articles/2024-07-05-sve_41-blog-industrial-automation",{"title":599,"_path":600},"Optimizing IoT Device Management: Top 3 Key Considerations","/news/articles/2024-07-27-blog-optimizing-iot",{"title":602,"_path":603},"The Emergence of Intelligent Transportation, Riding Smart","/news/articles/2024-07-29-sve_41-blog-intelligent-transportation",{"title":605,"_path":606},"MQTT vs LwM2M: The Battle of IoT Protocols for Lightweight Connectivity and Secure Device Management","/news/articles/2024-09-27-sve_42-blog-mqtt-vs-lwm2m",{"title":608,"_path":609},"OMA SpecWorks Announces LwM2M Test Event to be Held in Düsseldorf, Germany","/news/articles/2024-09-28-release-sve_42",{"title":544,"_path":545},{"title":544,"_path":541},{"title":613,"_path":614,"children":615},"EVENTS","/oma-events",[616,619,622,625],{"title":617,"_path":618},"Test Events","/oma-events/test-events",{"title":620,"_path":621},"Workshops","/oma-events/webinar-workshops",{"title":623,"_path":624},"Member's Meeting","/oma-events/members-meetings",{"title":613,"_path":614},{"title":627,"_path":628,"children":629},"TOOLS","/tools",[630,633,636,639,642,645],{"title":631,"_path":632},"LwM2M API Registry","/tools/lwm2m-api-registry",{"title":634,"_path":635},"LwM2M Editor | Validator","/tools/lwm2m-editor-validator",{"title":637,"_path":638},"LwM2M Developer's Tool Kit","/tools/lwm2m-tool-kit",{"title":640,"_path":641},"LwM2M Guidelines","/tools/lwm2m-guidelines",{"title":643,"_path":644},"LwM2M Validation Error Codes","/tools/validation-errors",{"title":646,"_path":628},"LwM2M TOOLS",{"title":648,"_path":649},"Contact Us","/contact-us",{"title":651,"_path":652},"Frequently Asked Questions","/faq",{"title":654,"_path":655},"Open Mobile Alliance","/",{"title":657,"_path":658},"Newsletter","/newsletter",{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"layout":10,"body":660,"_type":269,"_id":270,"_source":271,"_file":272,"_extension":273},{"type":12,"children":661,"toc":840},[662,666,670,674,678,682,686,690,694,698,702,706,710,714,718,722,726,730,734,738,742,746,750,759,763,767,771,775,779,783,787,791,819,820,824,828,832,836],{"type":15,"tag":16,"props":663,"children":664},{},[665],{"type":20,"value":21},{"type":15,"tag":23,"props":667,"children":668},{"id":25},[669],{"type":20,"value":28},{"type":15,"tag":16,"props":671,"children":672},{},[673],{"type":20,"value":33},{"type":15,"tag":23,"props":675,"children":676},{"id":36},[677],{"type":20,"value":39},{"type":15,"tag":16,"props":679,"children":680},{},[681],{"type":20,"value":44},{"type":15,"tag":23,"props":683,"children":684},{"id":47},[685],{"type":20,"value":50},{"type":15,"tag":16,"props":687,"children":688},{},[689],{"type":20,"value":55},{"type":15,"tag":16,"props":691,"children":692},{},[693],{"type":20,"value":60},{"type":15,"tag":16,"props":695,"children":696},{},[697],{"type":20,"value":65},{"type":15,"tag":16,"props":699,"children":700},{},[701],{"type":20,"value":70},{"type":15,"tag":16,"props":703,"children":704},{},[705],{"type":20,"value":75},{"type":15,"tag":23,"props":707,"children":708},{"id":78},[709],{"type":20,"value":81},{"type":15,"tag":16,"props":711,"children":712},{},[713],{"type":20,"value":86},{"type":15,"tag":23,"props":715,"children":716},{"id":89},[717],{"type":20,"value":92},{"type":15,"tag":16,"props":719,"children":720},{},[721],{"type":20,"value":97},{"type":15,"tag":16,"props":723,"children":724},{},[725],{"type":20,"value":102},{"type":15,"tag":16,"props":727,"children":728},{},[729],{"type":20,"value":107},{"type":15,"tag":16,"props":731,"children":732},{},[733],{"type":20,"value":112},{"type":15,"tag":23,"props":735,"children":736},{"id":115},[737],{"type":20,"value":118},{"type":15,"tag":16,"props":739,"children":740},{},[741],{"type":20,"value":123},{"type":15,"tag":16,"props":743,"children":744},{},[745],{"type":20,"value":128},{"type":15,"tag":23,"props":747,"children":748},{"id":131},[749],{"type":20,"value":134},{"type":15,"tag":16,"props":751,"children":752},{},[753,754,758],{"type":20,"value":139},{"type":15,"tag":141,"props":755,"children":756},{"href":143},[757],{"type":20,"value":146},{"type":20,"value":148},{"type":15,"tag":23,"props":760,"children":761},{"id":151},[762],{"type":20,"value":154},{"type":15,"tag":16,"props":764,"children":765},{},[766],{"type":20,"value":159},{"type":15,"tag":23,"props":768,"children":769},{"id":162},[770],{"type":20,"value":165},{"type":15,"tag":16,"props":772,"children":773},{},[774],{"type":20,"value":170},{"type":15,"tag":23,"props":776,"children":777},{"id":173},[778],{"type":20,"value":176},{"type":15,"tag":16,"props":780,"children":781},{},[782],{"type":20,"value":181},{"type":15,"tag":16,"props":784,"children":785},{},[786],{"type":20,"value":186},{"type":15,"tag":16,"props":788,"children":789},{},[790],{"type":20,"value":191},{"type":15,"tag":193,"props":792,"children":793},{},[794,795,799,800,804,805,809,810,814,815],{"type":20,"value":197},{"type":15,"tag":199,"props":796,"children":797},{},[798],{"type":20,"value":203},{"type":20,"value":197},{"type":15,"tag":199,"props":801,"children":802},{},[803],{"type":20,"value":209},{"type":20,"value":197},{"type":15,"tag":199,"props":806,"children":807},{},[808],{"type":20,"value":215},{"type":20,"value":197},{"type":15,"tag":199,"props":811,"children":812},{},[813],{"type":20,"value":221},{"type":20,"value":197},{"type":15,"tag":199,"props":816,"children":817},{},[818],{"type":20,"value":227},{"type":20,"value":229},{"type":15,"tag":16,"props":821,"children":822},{},[823],{"type":20,"value":234},{"type":15,"tag":16,"props":825,"children":826},{},[827],{"type":20,"value":239},{"type":15,"tag":16,"props":829,"children":830},{},[831],{"type":20,"value":244},{"type":15,"tag":16,"props":833,"children":834},{},[835],{"type":20,"value":249},{"type":15,"tag":16,"props":837,"children":838},{},[839],{"type":20,"value":254},{"title":7,"searchDepth":256,"depth":256,"links":841},[842,843,844,845,846,847,848,849,850,851],{"id":25,"depth":259,"text":28},{"id":36,"depth":259,"text":39},{"id":47,"depth":259,"text":50},{"id":78,"depth":259,"text":81},{"id":89,"depth":259,"text":92},{"id":115,"depth":259,"text":118},{"id":131,"depth":259,"text":134},{"id":151,"depth":259,"text":154},{"id":162,"depth":259,"text":165},{"id":173,"depth":259,"text":176},1729708705593]