[{"data":1,"prerenderedAt":887},["ShallowReactive",2],{"page-data":3,"docs-/news/articles/2024-06-03-blog-post-sve_41":54,"content-query-yOx4RBdQcZ":390,"navigation":411},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":5,"title":7,"description":8,"visible":9,"body":10,"_type":49,"_id":50,"_source":51,"_file":52,"_extension":53},"/announcement","",false,"Announcement","uCIFI® Alliance Joins Forces with OMA SpecWorks. Click HERE to learn more.",true,{"type":11,"children":12,"toc":46},"root",[13],{"type":14,"tag":15,"props":16,"children":17},"element","p",{},[18],{"type":14,"tag":19,"props":20,"children":23},"span",{"className":21},[22],"text-2xl",[24,27,44],{"type":25,"value":26},"text","uCIFI® Alliance Joins Forces with OMA SpecWorks. Click ",{"type":14,"tag":28,"props":29,"children":41},"a",{":target":30,"className":31,"href":38,"rel":39},"_blank",[32,33,34,35,36,37],"animate-pulse","font-extrabold","text-teal-500","hover:text-teal-300","dark:text-teal-500","hover:dark:text-teal-300","https://www.einpresswire.com/shareable-preview/bDaRtTUI5OK5YYG1pF1NZw",[40],"nofollow",[42],{"type":25,"value":43},"HERE",{"type":25,"value":45}," to learn more.",{"title":5,"searchDepth":47,"depth":47,"links":48},2,[],"markdown","content:announcement.md","content","announcement.md","md",{"_path":55,"_dir":56,"_draft":6,"_partial":6,"_locale":5,"title":57,"description":58,"layout":56,"urlImage":59,"imageBackground":5,"subtitle":60,"leftLabel":61,"rightLabel":62,"cardID":63,"tags":64,"excerpt":67,"body":73,"_type":49,"_id":388,"_source":51,"_file":389,"_extension":53},"/news/articles/2024-06-03-blog-post-sve_41","articles","Harnessing the Power of Automation and IoT in the Utilities Industry","The utilities industry is undergoing a transformative shift, driven by the integration of automation, Internet of Things (IoT), and advanced sensor systems. Automation is taking place in water conservation, waste management, oil monitoring, and energy usage/conservation. A number of key technologies are revolutionizing how utilities operate, enabling more efficient monitoring, enhanced asset management, and a stronger commitment to sustainability.","/images/news/modernazing-utilities.png",null,"2024-June-3","OMA",85,[65,66],"news","workshop",{"type":11,"children":68},[69],{"type":14,"tag":15,"props":70,"children":71},{},[72],{"type":25,"value":58},{"type":11,"children":74,"toc":383},[75,79,84,93,98,106,111,119,124,132,137,145,150,158,163,171,176,181,189,196,198,204,206,212,214,220,222,256,262,264,270,319,325,375,381],{"type":14,"tag":15,"props":76,"children":77},{},[78],{"type":25,"value":58},{"type":14,"tag":15,"props":80,"children":81},{},[82],{"type":25,"value":83},"Key trends such as Lightweight Machine-to-Machine (LwM2M) protocol adoption, smart metering (AMI - advanced metering infrastructure), and predictive maintenance are paving the way for a smarter and more sustainable future. Below are some key trends in the utilities industry:",{"type":14,"tag":15,"props":85,"children":86},{},[87],{"type":14,"tag":88,"props":89,"children":90},"strong",{},[91],{"type":25,"value":92},"Grid Modernization",{"type":14,"tag":15,"props":94,"children":95},{},[96],{"type":25,"value":97},"The industry is undergoing a shift to modernize key infrastructure, delivery, and services. The aging electrical grid is currently experiencing modernization with advanced technologies such as smart meters, sensors, and automation systems. This is expected to improve grid reliability, enhance outage management, and better the integration of renewable energy sources.",{"type":14,"tag":15,"props":99,"children":100},{},[101],{"type":14,"tag":88,"props":102,"children":103},{},[104],{"type":25,"value":105},"Renewable Energy Integration",{"type":14,"tag":15,"props":107,"children":108},{},[109],{"type":25,"value":110},"As part of sustainability across utilities, we are seeing an increasing adoption of renewable energy sources like solar, wind, and hydroelectric power, along with the push for electric vehicles (EVs).The goal is to reduce carbon emissions, provide a diversification of energy supply and resources, and align with sustainable development goals (SDGs). While EVs have not taken off as expected due to lowering demands, the infrastructure is also playing catch up as charging stations continue to be constructed across the U.S.",{"type":14,"tag":15,"props":112,"children":113},{},[114],{"type":14,"tag":88,"props":115,"children":116},{},[117],{"type":25,"value":118},"Energy Storage Solutions",{"type":14,"tag":15,"props":120,"children":121},{},[122],{"type":25,"value":123},"Along the lines with a strong focus on renewable energy and resources, there is a growing trend in the deployment of large-scale battery storage systems to store energy generated from renewable sources. This trend is expected to enhance grid stability, improve the demand response capabilities, and enable efficient energy utilization.",{"type":14,"tag":15,"props":125,"children":126},{},[127],{"type":14,"tag":88,"props":128,"children":129},{},[130],{"type":25,"value":131},"Decentralization and Distributed Energy Resources (DER)",{"type":14,"tag":15,"props":133,"children":134},{},[135],{"type":25,"value":136},"There is a growing need for distributed energy resources such as rooftop solar panels, microgrids, and home energy storage systems. While these may be consumer oriented, these will likely impact increased energy independence for consumers, reduction in transmission losses, and build a more resilient energy infrastructure.",{"type":14,"tag":15,"props":138,"children":139},{},[140],{"type":14,"tag":88,"props":141,"children":142},{},[143],{"type":25,"value":144},"Electrification",{"type":14,"tag":15,"props":146,"children":147},{},[148],{"type":25,"value":149},"The expansion of electric vehicle (EV) infrastructure, including charging stations and grid integration, are driven around a reduced dependence on fossil fuels, lowering transportation emissions, and presenting new business opportunities for utilities and other precious resources.",{"type":14,"tag":15,"props":151,"children":152},{},[153],{"type":14,"tag":88,"props":154,"children":155},{},[156],{"type":25,"value":157},"Resource Protection & Cybersecurity",{"type":14,"tag":15,"props":159,"children":160},{},[161],{"type":25,"value":162},"As the industry automates, there is a growing focus on securing utility infrastructure against cyber threats.This will require increased investments in cybersecurity measures, the development of robust security protocols, and increased protection of critical infrastructure. Hacking and growing vulnerabilities also present a growing threat from outside entities and groups, as they seek to threaten U.S. infrastructure and services.",{"type":14,"tag":15,"props":164,"children":165},{},[166],{"type":14,"tag":88,"props":167,"children":168},{},[169],{"type":25,"value":170},"Data Analytics and AI",{"type":14,"tag":15,"props":172,"children":173},{},[174],{"type":25,"value":175},"The utilization of big data and artificial intelligence to optimize grid operations, forecast energy demand, and enhance customer experiences will continue to be a trend beyond 2024. Date intelligence brings actionable insights, alerting, and can trigger automated actions for maintenance, delivery, optimization, and consumption management. This brings improved decision-making, proactive maintenance, and tailored energy solutions for consumers.",{"type":14,"tag":15,"props":177,"children":178},{},[179],{"type":25,"value":180},"These trends reflect the utilities sector's efforts to adapt to a rapidly changing energy landscape, driven by technological innovations and the need for more sustainable and resilient energy systems.",{"type":14,"tag":182,"props":183,"children":186},"h3",{"style":184,"id":185},"color:DodgerBlue;","_4-key-utility-trends-in-lwm2m-iot-and-sensor-systems",[187],{"type":25,"value":188},"4 Key Utility Trends in LwM2M, IoT, and Sensor Systems",{"type":14,"tag":190,"props":191,"children":193},"h4",{"id":192},"_1-lightweight-machine-to-machine-lwm2m-protocol",[194],{"type":25,"value":195},"1. Lightweight Machine-to-Machine (LwM2M) Protocol",{"type":25,"value":197},"\nLwM2M serves as a critical protocol for IoT device management in the utilities sector. Designed by the Open Mobile Alliance (omaspecworks.org), LwM2M is optimized for constrained devices, making it ideal for the utilities industry where numerous devices need to communicate efficiently. LwM2M offers efficient communication and management of devices, which is crucial for large-scale deployments in utilities. Enhanced security features ensure that data transmission between devices and servers is secure, addressing a major concern in IoT implementations. LwM2M supports a wide range of devices and applications, promoting interoperability and seamless integration within existing systems.\n",{"type":14,"tag":190,"props":199,"children":201},{"id":200},"_2-smart-metering",[202],{"type":25,"value":203},"2. Smart Metering",{"type":25,"value":205},"\nSmart meters are a cornerstone of modern utility networks, providing real-time data on energy and resource consumption, water usage, and gas distribution. These meters are equipped with IoT capabilities, allowing for real-time monitoring, dynamic pricing, and fault/anomaly detection. Consumers and utility providers can monitor usage in real-time, leading to more informed decision-making and efficient energy use. Utilities companies (public and private) can implement dynamic pricing models, offering incentives for off-peak usage and promoting energy conservation. Smart meters can also detect anomalies and faults in the network, enabling quicker response times and reducing downtime. Anomaly detection can support predictive maintenance, repair dispatching, and prevent catastrophes or disruptions in service.\n",{"type":14,"tag":190,"props":207,"children":209},{"id":208},"_3-predictive-maintenance",[210],{"type":25,"value":211},"3. Predictive Maintenance",{"type":25,"value":213},"\nPredictive maintenance leverages IoT and sensor data to predict equipment failures before they occur. This approach significantly enhances asset management by predicting failures, saving overall costs, and offering data-driven decision-making. Predictive analytics can forecast when a piece of equipment or hardware is likely to fail, allowing for timely maintenance and reducing unplanned outages. By preventing unexpected breakdowns, utilities can save on costly emergency repairs and extend the lifespan of their assets. In addition, continuous monitoring and data collection enables better planning and decision-making, improving overall operational efficiency. But remember, the quality of the data is important...quality data in = quality data out!\n",{"type":14,"tag":190,"props":215,"children":217},{"id":216},"_4-sustainability-initiatives",[218],{"type":25,"value":219},"4. Sustainability Initiatives",{"type":25,"value":221},"\nAutomation and IoT are instrumental in driving sustainability in the utilities industry. As mentioned previously, key initiatives include:\n",{"type":14,"tag":223,"props":224,"children":225},"ul",{},[226,236,246],{"type":14,"tag":227,"props":228,"children":229},"li",{},[230,234],{"type":14,"tag":88,"props":231,"children":232},{},[233],{"type":25,"value":105},{"type":25,"value":235},": IoT systems facilitate the integration of renewable energy sources into the grid, optimizing the balance between supply and demand.",{"type":14,"tag":227,"props":237,"children":238},{},[239,244],{"type":14,"tag":88,"props":240,"children":241},{},[242],{"type":25,"value":243},"Energy Efficiency",{"type":25,"value":245},": Automated systems can identify areas where energy consumption can be reduced, promoting more efficient use of resources.",{"type":14,"tag":227,"props":247,"children":248},{},[249,254],{"type":14,"tag":88,"props":250,"children":251},{},[252],{"type":25,"value":253},"Carbon Footprint Reduction",{"type":25,"value":255},": Advanced monitoring and management systems help utilities track and reduce their carbon footprint, contributing to broader environmental goals.",{"type":14,"tag":182,"props":257,"children":259},{"style":184,"id":258},"diving-into-both-water-waste-management",[260],{"type":25,"value":261},"Diving into both Water & Waste Management",{"type":25,"value":263},"\nElectrical utilities generally get all the love, so we want to explore a few other utility areas and how IoT/automation is impacting efficiencies, improvements, and quality of services. Below are a few examples of both water and waste management. The Internet of Things (IoT) is increasingly being utilized for water and waste management, providing smart solutions to optimize resource usage, improve efficiency, and reduce environmental impact. Let’s take a closer look...\n",{"type":14,"tag":190,"props":265,"children":267},{"id":266},"water-management",[268],{"type":25,"value":269},"Water Management",{"type":14,"tag":223,"props":271,"children":273},{"style":272},"list-style-type:none;",[274,276,286,287,297,298,308,309],{"type":25,"value":275},"\n    ",{"type":14,"tag":227,"props":277,"children":278},{},[279,284],{"type":14,"tag":88,"props":280,"children":281},{},[282],{"type":25,"value":283},"Smart Water Meters",{"type":25,"value":285},": Utilities deploy smart water meters that monitor water consumption in real-time, allowing for detailed usage data. This helps in detecting leaks, reducing water wastage, and enabling users to monitor and manage their water usage more effectively. The benefit is Improved accuracy in billing, early detection of leaks, and better water conservation.",{"type":25,"value":275},{"type":14,"tag":227,"props":288,"children":289},{},[290,295],{"type":14,"tag":88,"props":291,"children":292},{},[293],{"type":25,"value":294},"Leak Detection Systems",{"type":25,"value":296},": IoT sensors are installed in water pipelines to detect leaks or bursts. These sensors send alerts to maintenance teams for immediate action. Leak detection can help reduce water loss, prevent major infrastructure damage, and provide cost savings on repairs.",{"type":25,"value":275},{"type":14,"tag":227,"props":299,"children":300},{},[301,306],{"type":14,"tag":88,"props":302,"children":303},{},[304],{"type":25,"value":305},"Water Quality Monitoring",{"type":25,"value":307},": Sensors measure various water quality parameters such as pH, turbidity, temperature, and chemical contaminants in real-time. This is particularly useful in municipal water supplies and industrial processes. Monitoring can help ensure safe drinking water, compliance with health regulations, and proactive management of water quality.",{"type":25,"value":275},{"type":14,"tag":227,"props":310,"children":311},{},[312,317],{"type":14,"tag":88,"props":313,"children":314},{},[315],{"type":25,"value":316},"Smart Irrigation Systems",{"type":25,"value":318},": IoT-enabled irrigation systems use soil moisture sensors and weather data to optimize watering schedules for agricultural fields and urban green spaces. The benefits may include efficient water use, enhanced crop yield, and reduced water and energy consumption.",{"type":14,"tag":190,"props":320,"children":322},{"id":321},"waste-management",[323],{"type":25,"value":324},"Waste Management",{"type":14,"tag":223,"props":326,"children":327},{"style":272},[328,329,339,341,351,352,362,363,373],{"type":25,"value":275},{"type":14,"tag":227,"props":330,"children":331},{},[332,337],{"type":14,"tag":88,"props":333,"children":334},{},[335],{"type":25,"value":336},"Smart Waste Bins",{"type":25,"value":338},": IoT-enabled waste bins are equipped with sensors that monitor the fill level of the bins and communicate this data to waste management authorities. These smart waste bins optimize waste collection routes, reduce operational costs, and enable cleaner urban environments.",{"type":25,"value":340},"  \n    ",{"type":14,"tag":227,"props":342,"children":343},{},[344,349],{"type":14,"tag":88,"props":345,"children":346},{},[347],{"type":25,"value":348},"Fleet Management for Waste Collection",{"type":25,"value":350},": GPS (location identification) and IoT technology are used to track waste collection vehicles, optimize routes based on real-time traffic data, ensure safety of the drivers, optimize compliance, and identify bin fill levels. As fleet management and monitoring adoption continues, the goal is to reduce fuel consumption, lower emissions, improve safety, reduce collisions, and provide more efficient waste collection.",{"type":25,"value":340},{"type":14,"tag":227,"props":353,"children":354},{},[355,360],{"type":14,"tag":88,"props":356,"children":357},{},[358],{"type":25,"value":359},"Waste Sorting and Recycling",{"type":25,"value":361},": IoT systems including AI (artificial intelligence and machine learning) are integrated into recycling facilities to sort waste more efficiently using automated systems that identify and separate materials based on type and recyclability. This brings the benefit of increased recycling rates, reduced contamination of recyclable materials, and better resource recovery.",{"type":25,"value":340},{"type":14,"tag":227,"props":364,"children":365},{},[366,371],{"type":14,"tag":88,"props":367,"children":368},{},[369],{"type":25,"value":370},"Landfill Management",{"type":25,"value":372},": Sensors monitor various environmental factors such as gas emissions, temperature, air quality and detection, and moisture levels in landfills to manage and mitigate the impact of waste decomposition. This automation improves environmental compliance, enhanced safety, and better management of landfill operations.",{"type":25,"value":374},"  \n",{"type":14,"tag":190,"props":376,"children":378},{"style":184,"id":377},"wrap-up",[379],{"type":25,"value":380},"Wrap Up",{"type":25,"value":382},"\nThe integration of automation, IoT, and advanced sensor systems is transforming the utilities industry, bringing about significant improvements in monitoring, asset management, and sustainability. The adoption of LwM2M protocol, the proliferation of smart meters and monitoring, the implementation of predictive maintenance, and the drive towards sustainability are key trends shaping the future of utilities. AI will play a growing role in providing additional layers of data intelligence and automation over the coming years. As these technologies continue to evolve, they promise to create a more efficient, resilient, and environmentally friendly utilities sector and will improve urban and rural utility services overall. By embracing these innovations, utilities can not only enhance their operational efficiency but also contribute to a more sustainable future, benefiting both consumers and the environment.\n",{"title":5,"searchDepth":47,"depth":47,"links":384},[385,387],{"id":185,"depth":386,"text":188},3,{"id":258,"depth":386,"text":261},"content:5.news:articles:2024-06-03-Blog-post-SVE_41.md","5.news/articles/2024-06-03-Blog-post-SVE_41.md",[391],{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":5,"title":7,"description":8,"visible":9,"body":392,"_type":49,"_id":50,"_source":51,"_file":52,"_extension":53},{"type":11,"children":393,"toc":409},[394],{"type":14,"tag":15,"props":395,"children":396},{},[397],{"type":14,"tag":19,"props":398,"children":400},{"className":399},[22],[401,402,408],{"type":25,"value":26},{"type":14,"tag":28,"props":403,"children":406},{":target":30,"className":404,"href":38,"rel":405},[32,33,34,35,36,37],[40],[407],{"type":25,"value":43},{"type":25,"value":45},{"title":5,"searchDepth":47,"depth":47,"links":410},[],[412,528,579,651,679,758,772,793,865,866,869,872,875,878,881,884],{"title":413,"_path":414,"children":415},"OMASPECWORKS","/omaspecworks",[416,454,468,520,526],{"title":417,"_path":418,"children":419},"About","/omaspecworks/about",[420,423,435,452],{"title":421,"_path":422},"OMA SpecWorks","/omaspecworks/about/omaspecworks",{"title":424,"_path":425,"children":426},"Intelectual Property Rights","/omaspecworks/about/ipr",[427,430,433],{"title":428,"_path":429},"Members IPR","/omaspecworks/about/ipr/members",{"title":431,"_path":432},"Non Members IPR","/omaspecworks/about/ipr/non-members",{"title":434,"_path":425},"Intellectual Property Rights",{"title":436,"_path":437,"children":438},"Policies & Terms","/omaspecworks/about/policies-terms",[439,442,445,448,451],{"title":440,"_path":441},"Use Agreement","/omaspecworks/about/policies-terms/use-agreement",{"title":443,"_path":444},"Trade Marks","/omaspecworks/about/policies-terms/trademarks",{"title":446,"_path":447},"Openness Policy","/omaspecworks/about/policies-terms/openness",{"title":449,"_path":450},"OMA Meeting Guest Policy","/omaspecworks/about/policies-terms/guest-policy",{"title":436,"_path":437},{"title":453,"_path":418},"About OMA SpecWorks",{"title":455,"_path":456,"children":457},"Membership","/omaspecworks/membership",[458,461,464,467],{"title":459,"_path":460},"Join OMA","/omaspecworks/membership/join",{"title":462,"_path":463},"Membership Benefits","/omaspecworks/membership/benefits",{"title":465,"_path":466},"Members","/omaspecworks/membership/members",{"title":455,"_path":456},{"title":469,"_path":470,"children":471},"Collaborate","/omaspecworks/collaborate",[472,475,478,518],{"title":473,"_path":474},"Working Groups","/omaspecworks/collaborate/working-groups",{"title":476,"_path":477},"Liaison Agreements","/omaspecworks/collaborate/liaison-agreements",{"title":479,"_path":480,"children":481},"Affiliates","/omaspecworks/collaborate/affiliates",[482,487,492,497,502,507,512,517],{"title":483,"_path":484,"children":485},"Location Interoperatility","/omaspecworks/collaborate/affiliates/location-interoperability",[486],{"title":483,"_path":484},{"title":488,"_path":489,"children":490},"Mobile Games Interoperability","/omaspecworks/collaborate/affiliates/mobile-games-interoperability",[491],{"title":488,"_path":489},{"title":493,"_path":494,"children":495},"Mobile Wireless Internet Forum","/omaspecworks/collaborate/affiliates/mobile-wireless-internet-forum",[496],{"title":493,"_path":494},{"title":498,"_path":499,"children":500},"SyncML","/omaspecworks/collaborate/affiliates/syncml",[501],{"title":498,"_path":499},{"title":503,"_path":504,"children":505},"WAP Forum","/omaspecworks/collaborate/affiliates/wap-forum",[506],{"title":503,"_path":504},{"title":508,"_path":509,"children":510},"Wireless Village","/omaspecworks/collaborate/affiliates/wireless-village",[511],{"title":508,"_path":509},{"title":513,"_path":514,"children":515},"InLocation Alliance","/omaspecworks/collaborate/affiliates/in-location-alliance",[516],{"title":513,"_path":514},{"title":479,"_path":480},{"title":519,"_path":470},"Collaborate with OMASpecWorks",{"title":521,"_path":522,"children":523},"Get Involved","/omaspecworks/get-involved",[524],{"title":525,"_path":522},"Get Involved with OMA",{"title":527,"_path":414},"Welcome to OMASPECWORKS",{"title":529,"_path":530,"children":531},"SPECIFICATIONS","/specifications",[532,546,560,578],{"title":533,"_path":534,"children":535},"Search","/specifications/search",[536,537,540,543],{"title":533,"_path":534},{"title":538,"_path":539},"by Specifications","/specifications/search/specifications",{"title":541,"_path":542},"by Enablers","/specifications/search/enablers",{"title":544,"_path":545},"by Public Documents","/specifications/search/public-docs",{"title":547,"_path":548,"children":549},"OMNA Registries","/specifications/registries",[550,555,558],{"title":551,"_path":552,"children":553},"Enabler Registries","/specifications/registries/enablers",[554],{"title":551,"_path":552},{"title":556,"_path":557},"Supporting Data","/specifications/registries/supporting-data",{"title":559,"_path":548},"OMNA Registries Overview",{"title":561,"_path":562,"children":563},"OMA Inventory API","/specifications/api",[564,567,570,573,576],{"title":565,"_path":566},"Abstract Protocol Binding","/specifications/api/abstract",{"title":568,"_path":569},"RESTful API","/specifications/api/http",{"title":571,"_path":572},"SOAP Web Services APIs","/specifications/api/soap",{"title":574,"_path":575},"LDAP APIs","/specifications/api/webidl",{"title":577,"_path":562},"OMA Enablers API's",{"title":529,"_path":530},{"title":580,"_path":581,"children":582},"LwM2M","/lwm2m",[583,597,608,636,647,649],{"title":584,"_path":585,"children":586},"What is LwM2M","/lwm2m/whatis",[587,590,593,596],{"title":588,"_path":589},"LwM2M Components","/lwm2m/whatis/components",{"title":591,"_path":592},"Key Features","/lwm2m/whatis/key-features",{"title":594,"_path":595},"LwM2M Benefits","/lwm2m/whatis/benefits",{"title":584,"_path":585},{"title":598,"_path":599,"children":600},"Applications & Use Cases","/lwm2m/applications-use-cases",[601,604,607],{"title":602,"_path":603},"Industry Use Cases","/lwm2m/applications-use-cases/use-cases",{"title":605,"_path":606},"Industrial Applications","/lwm2m/applications-use-cases/industrial-applications",{"title":598,"_path":599},{"title":609,"_path":610,"children":611},"LwM2M Resources & Tools","/lwm2m/resources",[612,626,629,632,635],{"title":613,"_path":614,"children":615},"LwM2M Registry","/lwm2m/resources/registry",[616,619,622,625],{"title":617,"_path":618},"Objects","/lwm2m/resources/registry/objects",{"title":620,"_path":621},"Resources","/lwm2m/resources/registry/resources",{"title":623,"_path":624},"Vendor Bulk Reservations","/lwm2m/resources/registry/vendor-bulk-reservations",{"title":613,"_path":614},{"title":627,"_path":628},"LwM2M Specifications","/lwm2m/resources/specifications",{"title":630,"_path":631},"LwM2M Enablers","/lwm2m/resources/lwm2m-enablers",{"title":633,"_path":634},"Tutorials & Guidelines","/lwm2m/resources/tutorials-guidelines",{"title":609,"_path":610},{"title":637,"_path":638,"children":639},"Community & Events","/lwm2m/community",[640,643,646],{"title":641,"_path":642},"LwM2M Implementations","/lwm2m/community/implementations",{"title":644,"_path":645},"LwM2M Product Listing","/lwm2m/community/product-listing",{"title":637,"_path":638},{"title":521,"_path":648},"/lwm2m/get-involved",{"title":650,"_path":581},"About LwM2M",{"title":652,"_path":653,"children":654},"UTILITIES","/utilities",[655,658,672,677],{"title":656,"_path":657},"Introduction","/utilities/introduction",{"title":659,"_path":660,"children":661},"Market Potential","/utilities/market-potential",[662,665,668,671],{"title":663,"_path":664},"Use Cases","/utilities/market-potential/use-cases",{"title":666,"_path":667},"LwM2M Utilities Benefits","/utilities/market-potential/whitepaper-lwm2m-utilities-benefits",{"title":669,"_path":670},"LwM2M Metering Use Case","/utilities/market-potential/whitepaper-lwm2m-metering-use-case",{"title":659,"_path":660},{"title":673,"_path":674,"children":675},"Promoting LwM2M for Utilities","/utilities/promotion",[676],{"title":5,"_path":674},{"title":678,"_path":653},"LwM2M for Utilities",{"title":680,"_path":681,"children":682},"NEWS","/news",[683,757],{"title":684,"_path":685,"children":686},"Articles","/news/articles",[687,690,693,696,699,702,705,708,711,714,717,720,723,726,729,732,735,736,739,742,745,748,751,754],{"title":688,"_path":689},"An Application-Layer Approach to End-to-End Security for the Internet of Things","/news/articles/2019-07-30-e2e-security-for-iot",{"title":691,"_path":692},"White Paper - OMA LwM2M - Ready for 5G","/news/articles/2020-01-23-lwm2m-5g",{"title":694,"_path":695},"LwM2M v1.2 is now available!","/news/articles/2020-12-09-lwm2m-release",{"title":697,"_path":698},"uCIFI Alliance Contributes 29 Objects to OMA","/news/articles/2021-03-02-ucifi",{"title":700,"_path":701},"LwM2M in ENISA’s Secure Supply Chain for IoT V1.0","/news/articles/2021-05-19-enisa-lw2m2-wp",{"title":703,"_path":704},"LwM2M in ENISA’s Secure Supply Chain for IoT","/news/articles/2021-07-8-enisa",{"title":706,"_path":707},"LwM2M Objects for nuSIM Integrated SIM","/news/articles/2022-04-12-nusim_objects",{"title":709,"_path":710},"Advanced LwM2M Firmware Update Object","/news/articles/2022-05-30-advance-firmware-update-lwm2m-object",{"title":712,"_path":713},"LwM2M, Bootstrapping in Cellular Networks","/news/articles/2022-06-14-bootstrapping-cellular-networks",{"title":715,"_path":716},"OMA LwM2M v1.2.1 Release","/news/articles/2022-12-09-release-v1_2_1",{"title":718,"_path":719},"IoT and LwM2M for Utilities","/news/articles/2023-06-09-iot-utilities-outreach-post-workshop",{"title":721,"_path":722},"Unlocking Utility Benefits with LwM2M","/news/articles/2023-10-03-outreach-utility-november",{"title":724,"_path":725},"A Tailored Solution for Utilities","/news/articles/2023-11-15-unlocking-utility-benefits-with-lwm2m-nov-15",{"title":727,"_path":728},"Virtual Test Event","/news/articles/2023-11-20-sve-40-virtual-test-event-nov-23",{"title":730,"_path":731},"Revolutionizing the Utilities Sector - The Transformative Power of LwM2M","/news/articles/2024-02-16-utility-webinar-feb-8",{"title":733,"_path":734},"OMA SpecWorks Announces LwM2M Test Event to Enable M2M and IoT Use Cases","/news/articles/2024-05-28-release-sve_41",{"title":57,"_path":55},{"title":737,"_path":738},"Industrial Automation: Connecting Operations, People, Machines","/news/articles/2024-07-05-sve_41-blog-industrial-automation",{"title":740,"_path":741},"Optimizing IoT Device Management: Top 3 Key Considerations","/news/articles/2024-07-27-blog-optimizing-iot",{"title":743,"_path":744},"The Emergence of Intelligent Transportation, Riding Smart","/news/articles/2024-07-29-sve_41-blog-intelligent-transportation",{"title":746,"_path":747},"MQTT vs LwM2M: The Battle of IoT Protocols for Lightweight Connectivity and Secure Device Management","/news/articles/2024-09-27-sve_42-blog-mqtt-vs-lwm2m",{"title":749,"_path":750},"OMA SpecWorks Announces LwM2M Test Event to be Held in Düsseldorf, Germany","/news/articles/2024-09-28-release-sve_42",{"title":752,"_path":753},"Harnessing Intelligence in IoT Dashboard Analytics","/news/articles/2024-11-8-blog-harnessing-intelligence-in-iot",{"title":755,"_path":756},"uCIFI® Alliance Joins Forces with OMA SpecWorks","/news/articles/2024-12-9-press-release-ucifi-joins-oma",{"title":684,"_path":681},{"title":759,"_path":760,"children":761},"EVENTS","/oma-events",[762,765,768,771],{"title":763,"_path":764},"Test Events","/oma-events/test-events",{"title":766,"_path":767},"Workshops","/oma-events/webinar-workshops",{"title":769,"_path":770},"Member's Meeting","/oma-events/members-meetings",{"title":759,"_path":760},{"title":773,"_path":774,"children":775},"TOOLS","/tools",[776,779,782,785,788,791],{"title":777,"_path":778},"LwM2M API Registry","/tools/lwm2m-api-registry",{"title":780,"_path":781},"LwM2M Editor | Validator","/tools/lwm2m-editor-validator",{"title":783,"_path":784},"LwM2M Developer's Tool Kit","/tools/lwm2m-tool-kit",{"title":786,"_path":787},"LwM2M Guidelines","/tools/lwm2m-guidelines",{"title":789,"_path":790},"LwM2M Validation Error Codes","/tools/validation-errors",{"title":792,"_path":774},"LwM2M TOOLS",{"title":794,"_path":795,"children":796},"Guidelines","/guidelines",[797,802,864],{"title":798,"_path":799,"children":800},"Looks & Feel","/guidelines/looks-feel",[801],{"title":656,"_path":799},{"title":803,"_path":804,"children":805},"Components","/guidelines/components",[806,807,810,813,816,819,822,825,828,831,834,837,840,843,846,849,852,855,858,861],{"title":803,"_path":804},{"title":808,"_path":809},"Action Card","/guidelines/components/sh-action-card",{"title":811,"_path":812},"Alert","/guidelines/components/sh-alert",{"title":814,"_path":815},"Avatar","/guidelines/components/sh-avatar",{"title":817,"_path":818},"Badge","/guidelines/components/sh-badge",{"title":820,"_path":821},"Button","/guidelines/components/sh-button",{"title":823,"_path":824},"Card","/guidelines/components/sh-card",{"title":826,"_path":827},"Carousel","/guidelines/components/sh-carousel",{"title":829,"_path":830},"Column","/guidelines/components/sh-column",{"title":832,"_path":833},"Dynamic Table","/guidelines/components/sh-dynamic-table",{"title":835,"_path":836},"FAQ","/guidelines/components/sh-faq",{"title":838,"_path":839},"Image Container","/guidelines/components/sh-img-container",{"title":841,"_path":842},"ListCards","/guidelines/components/sh-list-cards",{"title":844,"_path":845},"Micro Card","/guidelines/components/sh-micro-card",{"title":847,"_path":848},"Multi Column","/guidelines/components/sh-multi-column",{"title":850,"_path":851},"Segment","/guidelines/components/sh-segment",{"title":853,"_path":854},"Social","/guidelines/components/sh-social",{"title":856,"_path":857},"Text&Image","/guidelines/components/sh-text-img",{"title":859,"_path":860},"TwoColumns","/guidelines/components/sh-two-columns",{"title":862,"_path":863},"Video","/guidelines/components/sh-video",{"title":794,"_path":795},{"title":7,"_path":4},{"title":867,"_path":868},"Contact Us","/contact-us",{"title":870,"_path":871},"Frequently Asked Questions","/faq",{"title":873,"_path":874},"Open Mobile Alliance","/",{"title":876,"_path":877},"Landing Page Floaters","/landing-page-floaters",{"title":879,"_path":880},"Landing Page Menu","/landing-page-menu",{"title":882,"_path":883},"Newsletter","/newsletter",{"title":885,"_path":886},"OMA Test Lab","/test-guide",1733857758013]